keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH100_RDCRCR.
* To use register names with standard convension, please use DMA_CH100_RDCRCR.
*/
#define	DMA_RDCRCR100	(DMA_CH100_RDCRCR)

/** \\brief  2C88, DMA Channel Source Address Register */
#define DMA_CH100_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012C88u)

/** Alias (User Manual Name) for DMA_CH100_SADR.
* To use register names with standard convension, please use DMA_CH100_SADR.
*/
#define	DMA_SADR100	(DMA_CH100_SADR)

/** \\brief  2C84, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH100_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012C84u)

/** Alias (User Manual Name) for DMA_CH100_SDCRCR.
* To use register names with standard convension, please use DMA_CH100_SDCRCR.
*/
#define	DMA_SDCRCR100	(DMA_CH100_SDCRCR)

/** \\brief  2C98, DMA Channel Shadow Address Register */
#define DMA_CH100_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012C98u)

/** Alias (User Manual Name) for DMA_CH100_SHADR.
* To use register names with standard convension, please use DMA_CH100_SHADR.
*/
#define	DMA_SHADR100	(DMA_CH100_SHADR)

/** \\brief  2CB0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH101_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012CB0u)

/** Alias (User Manual Name) for DMA_CH101_ADICR.
* To use register names with standard convension, please use DMA_CH101_ADICR.
*/
#define	DMA_ADICR101	(DMA_CH101_ADICR)

/** \\brief  2CB4, DMA Channel Configuration Register */
#define DMA_CH101_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012CB4u)

/** Alias (User Manual Name) for DMA_CH101_CHCFGR.
* To use register names with standard convension, please use DMA_CH101_CHCFGR.
*/
#define	DMA_CHCFGR101	(DMA_CH101_CHCFGR)

/** \\brief  2CBC, DMARAM Channel Control and Status Register */
#define DMA_CH101_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012CBCu)

/** Alias (User Manual Name) for DMA_CH101_CHCSR.
* To use register names with standard convension, please use DMA_CH101_CHCSR.
*/
#define	DMA_CHCSR101	(DMA_CH101_CHCSR)

/** \\brief  2CAC, DMA Channel Destination Address Register x */
#define DMA_CH101_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012CACu)

/** Alias (User Manual Name) for DMA_CH101_DADR.
* To use register names with standard convension, please use DMA_CH101_DADR.
*/
#define	DMA_DADR101	(DMA_CH101_DADR)

/** \\brief  2CA0, DMA Channel Read Data CRC Register */
#define DMA_CH101_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012CA0u)

/** Alias (User Manual Name) for DMA_CH101_RDCRCR.
* To use register names with standard convension, please use DMA_CH101_RDCRCR.
*/
#define	DMA_RDCRCR101	(DMA_CH101_RDCRCR)

/** \\brief  2CA8, DMA Channel Source Address Register */
#define DMA_CH101_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012CA8u)

/** Alias (User Manual Name) for DMA_CH101_SADR.
* To use register names with standard convension, please use DMA_CH101_SADR.
*/
#define	DMA_SADR101	(DMA_CH101_SADR)

/** \\brief  2CA4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH101_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012CA4u)

/** Alias (User Manual Name) for DMA_CH101_SDCRCR.
* To use register names with standard convension, please use DMA_CH101_SDCRCR.
*/
#define	DMA_SDCRCR101	(DMA_CH101_SDCRCR)

/** \\brief  2CB8, DMA Channel Shadow Address Register */
#define DMA_CH101_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012CB8u)

/** Alias (User Manual Name) for DMA_CH101_SHADR.
* To use register names with standard convension, please use DMA_CH101_SHADR.
*/
#define	DMA_SHADR101	(DMA_CH101_SHADR)

/** \\brief  2CD0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH102_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012CD0u)

/** Alias (User Manual Name) for DMA_CH102_ADICR.
* To use register names with standard convension, please use DMA_CH102_ADICR.
*/
#define	DMA_ADICR102	(DMA_CH102_ADICR)

/** \\brief  2CD4, DMA Channel Configuration Register */
#define DMA_CH102_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012CD4u)

/** Alias (User Manual Name) for DMA_CH102_CHCFGR.
* To use register names with standard convension, please use DMA_CH102_CHCFGR.
*/
#define	DMA_CHCFGR102	(DMA_CH102_CHCFGR)

/** \\brief  2CDC, DMARAM Channel Control and Status Register */
#define DMA_CH102_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012CDCu)

/** Alias (User Manual Name) for DMA_CH102_CHCSR.
* To use register names with standard convension, please use DMA_CH102_CHCSR.
*/
#define	DMA_CHCSR102	(DMA_CH102_CHCSR)

/** \\brief  2CCC, DMA Channel Destination Address Register x */
#define DMA_CH102_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012CCCu)

/** Alias (User Manual Name) for DMA_CH102_DADR.
* To use register names with standard convension, please use DMA_CH102_DADR.
*/
#define	DMA_DADR102	(DMA_CH102_DADR)

/** \\brief  2CC0, DMA Channel Read Data CRC Register */
#define DMA_CH102_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012CC0u)

/** Alias (User Manual Name) for DMA_CH102_RDCRCR.
* To use register names with standard convension, please use DMA_CH102_RDCRCR.
*/
#define	DMA_RDCRCR102	(DMA_CH102_RDCRCR)

/** \\brief  2CC8, DMA Channel Source Address Register */
#define DMA_CH102_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012CC8u)

/** Alias (User Manual Name) for DMA_CH102_SADR.
* To use register names with standard convension, please use DMA_CH102_SADR.
*/
#define	DMA_SADR102	(DMA_CH102_SADR)

/** \\brief  2CC4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH102_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012CC4u)

/** Alias (User Manual Name) for DMA_CH102_SDCRCR.
* To use register names with standard convension, please use DMA_CH102_SDCRCR.
*/
#define	DMA_SDCRCR102	(DMA_CH102_SDCRCR)

/** \\brief  2CD8, DMA Channel Shadow Address Register */
#define DMA_CH102_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012CD8u)

/** Alias (User Manual Name) for DMA_CH102_SHADR.
* To use register names with standard convension, please use DMA_CH102_SHADR.
*/
#define	DMA_SHADR102	(DMA_CH102_SHADR)

/** \\brief  2CF0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH103_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012CF0u)

/** Alias (User Manual Name) for DMA_CH103_ADICR.
* To use register names with standard convension, please use DMA_CH103_ADICR.
*/
#define	DMA_ADICR103	(DMA_CH103_ADICR)

/** \\brief  2CF4, DMA Channel Configuration Register */
#define DMA_CH103_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012CF4u)

