keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  2D90, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH108_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012D90u)

/** Alias (User Manual Name) for DMA_CH108_ADICR.
* To use register names with standard convension, please use DMA_CH108_ADICR.
*/
#define	DMA_ADICR108	(DMA_CH108_ADICR)

/** \\brief  2D94, DMA Channel Configuration Register */
#define DMA_CH108_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012D94u)

/** Alias (User Manual Name) for DMA_CH108_CHCFGR.
* To use register names with standard convension, please use DMA_CH108_CHCFGR.
*/
#define	DMA_CHCFGR108	(DMA_CH108_CHCFGR)

/** \\brief  2D9C, DMARAM Channel Control and Status Register */
#define DMA_CH108_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012D9Cu)

/** Alias (User Manual Name) for DMA_CH108_CHCSR.
* To use register names with standard convension, please use DMA_CH108_CHCSR.
*/
#define	DMA_CHCSR108	(DMA_CH108_CHCSR)

/** \\brief  2D8C, DMA Channel Destination Address Register x */
#define DMA_CH108_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012D8Cu)

/** Alias (User Manual Name) for DMA_CH108_DADR.
* To use register names with standard convension, please use DMA_CH108_DADR.
*/
#define	DMA_DADR108	(DMA_CH108_DADR)

/** \\brief  2D80, DMA Channel Read Data CRC Register */
#define DMA_CH108_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012D80u)

/** Alias (User Manual Name) for DMA_CH108_RDCRCR.
* To use register names with standard convension, please use DMA_CH108_RDCRCR.
*/
#define	DMA_RDCRCR108	(DMA_CH108_RDCRCR)

/** \\brief  2D88, DMA Channel Source Address Register */
#define DMA_CH108_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012D88u)

/** Alias (User Manual Name) for DMA_CH108_SADR.
* To use register names with standard convension, please use DMA_CH108_SADR.
*/
#define	DMA_SADR108	(DMA_CH108_SADR)

/** \\brief  2D84, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH108_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012D84u)

/** Alias (User Manual Name) for DMA_CH108_SDCRCR.
* To use register names with standard convension, please use DMA_CH108_SDCRCR.
*/
#define	DMA_SDCRCR108	(DMA_CH108_SDCRCR)

/** \\brief  2D98, DMA Channel Shadow Address Register */
#define DMA_CH108_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012D98u)

/** Alias (User Manual Name) for DMA_CH108_SHADR.
* To use register names with standard convension, please use DMA_CH108_SHADR.
*/
#define	DMA_SHADR108	(DMA_CH108_SHADR)

/** \\brief  2DB0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH109_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012DB0u)

/** Alias (User Manual Name) for DMA_CH109_ADICR.
* To use register names with standard convension, please use DMA_CH109_ADICR.
*/
#define	DMA_ADICR109	(DMA_CH109_ADICR)

/** \\brief  2DB4, DMA Channel Configuration Register */
#define DMA_CH109_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012DB4u)

/** Alias (User Manual Name) for DMA_CH109_CHCFGR.
* To use register names with standard convension, please use DMA_CH109_CHCFGR.
*/
#define	DMA_CHCFGR109	(DMA_CH109_CHCFGR)

/** \\brief  2DBC, DMARAM Channel Control and Status Register */
#define DMA_CH109_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012DBCu)

/** Alias (User Manual Name) for DMA_CH109_CHCSR.
* To use register names with standard convension, please use DMA_CH109_CHCSR.
*/
#define	DMA_CHCSR109	(DMA_CH109_CHCSR)

/** \\brief  2DAC, DMA Channel Destination Address Register x */
#define DMA_CH109_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012DACu)

/** Alias (User Manual Name) for DMA_CH109_DADR.
* To use register names with standard convension, please use DMA_CH109_DADR.
*/
#define	DMA_DADR109	(DMA_CH109_DADR)

/** \\brief  2DA0, DMA Channel Read Data CRC Register */
#define DMA_CH109_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012DA0u)

/** Alias (User Manual Name) for DMA_CH109_RDCRCR.
* To use register names with standard convension, please use DMA_CH109_RDCRCR.
*/
#define	DMA_RDCRCR109	(DMA_CH109_RDCRCR)

/** \\brief  2DA8, DMA Channel Source Address Register */
#define DMA_CH109_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012DA8u)

/** Alias (User Manual Name) for DMA_CH109_SADR.
* To use register names with standard convension, please use DMA_CH109_SADR.
*/
#define	DMA_SADR109	(DMA_CH109_SADR)

/** \\brief  2DA4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH109_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012DA4u)

/** Alias (User Manual Name) for DMA_CH109_SDCRCR.
* To use register names with standard convension, please use DMA_CH109_SDCRCR.
*/
#define	DMA_SDCRCR109	(DMA_CH109_SDCRCR)

/** \\brief  2DB8, DMA Channel Shadow Address Register */
#define DMA_CH109_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012DB8u)

/** Alias (User Manual Name) for DMA_CH109_SHADR.
* To use register names with standard convension, please use DMA_CH109_SHADR.
*/
#define	DMA_SHADR109	(DMA_CH109_SHADR)

/** \\brief  2150, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH10_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012150u)

/** Alias (User Manual Name) for DMA_CH10_ADICR.
* To use register names with standard convension, please use DMA_CH10_ADICR.
*/
#define	DMA_ADICR010	(DMA_CH10_ADICR)

/** \\brief  2154, DMA Channel Configuration Register */
#define DMA_CH10_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012154u)

/** Alias (User Manual Name) for DMA_CH10_CHCFGR.
* To use register names with standard convension, please use DMA_CH10_CHCFGR.
*/
#define	DMA_CHCFGR010	(DMA_CH10_CHCFGR)

/** \\brief  215C, DMARAM Channel Control and Status Register */
#define DMA_CH10_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001215Cu)

/** Alias (User Manual Name) for DMA_CH10_CHCSR.
* To use register names with standard convension, please use DMA_CH10_CHCSR.
*/
#define	DMA_CHCSR010	(DMA_CH10_CHCSR)

/** \\brief  214C, DMA Channel Destination Address Register x */
#define DMA_CH10_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001214Cu)

