keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  2DF8, DMA Channel Shadow Address Register */
#define DMA_CH111_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012DF8u)

/** Alias (User Manual Name) for DMA_CH111_SHADR.
* To use register names with standard convension, please use DMA_CH111_SHADR.
*/
#define	DMA_SHADR111	(DMA_CH111_SHADR)

/** \\brief  2E10, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH112_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012E10u)

/** Alias (User Manual Name) for DMA_CH112_ADICR.
* To use register names with standard convension, please use DMA_CH112_ADICR.
*/
#define	DMA_ADICR112	(DMA_CH112_ADICR)

/** \\brief  2E14, DMA Channel Configuration Register */
#define DMA_CH112_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012E14u)

/** Alias (User Manual Name) for DMA_CH112_CHCFGR.
* To use register names with standard convension, please use DMA_CH112_CHCFGR.
*/
#define	DMA_CHCFGR112	(DMA_CH112_CHCFGR)

/** \\brief  2E1C, DMARAM Channel Control and Status Register */
#define DMA_CH112_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012E1Cu)

/** Alias (User Manual Name) for DMA_CH112_CHCSR.
* To use register names with standard convension, please use DMA_CH112_CHCSR.
*/
#define	DMA_CHCSR112	(DMA_CH112_CHCSR)

/** \\brief  2E0C, DMA Channel Destination Address Register x */
#define DMA_CH112_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012E0Cu)

/** Alias (User Manual Name) for DMA_CH112_DADR.
* To use register names with standard convension, please use DMA_CH112_DADR.
*/
#define	DMA_DADR112	(DMA_CH112_DADR)

/** \\brief  2E00, DMA Channel Read Data CRC Register */
#define DMA_CH112_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012E00u)

/** Alias (User Manual Name) for DMA_CH112_RDCRCR.
* To use register names with standard convension, please use DMA_CH112_RDCRCR.
*/
#define	DMA_RDCRCR112	(DMA_CH112_RDCRCR)

/** \\brief  2E08, DMA Channel Source Address Register */
#define DMA_CH112_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012E08u)

/** Alias (User Manual Name) for DMA_CH112_SADR.
* To use register names with standard convension, please use DMA_CH112_SADR.
*/
#define	DMA_SADR112	(DMA_CH112_SADR)

/** \\brief  2E04, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH112_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012E04u)

/** Alias (User Manual Name) for DMA_CH112_SDCRCR.
* To use register names with standard convension, please use DMA_CH112_SDCRCR.
*/
#define	DMA_SDCRCR112	(DMA_CH112_SDCRCR)

/** \\brief  2E18, DMA Channel Shadow Address Register */
#define DMA_CH112_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012E18u)

/** Alias (User Manual Name) for DMA_CH112_SHADR.
* To use register names with standard convension, please use DMA_CH112_SHADR.
*/
#define	DMA_SHADR112	(DMA_CH112_SHADR)

/** \\brief  2E30, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH113_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012E30u)

/** Alias (User Manual Name) for DMA_CH113_ADICR.
* To use register names with standard convension, please use DMA_CH113_ADICR.
*/
#define	DMA_ADICR113	(DMA_CH113_ADICR)

/** \\brief  2E34, DMA Channel Configuration Register */
#define DMA_CH113_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012E34u)

/** Alias (User Manual Name) for DMA_CH113_CHCFGR.
* To use register names with standard convension, please use DMA_CH113_CHCFGR.
*/
#define	DMA_CHCFGR113	(DMA_CH113_CHCFGR)

/** \\brief  2E3C, DMARAM Channel Control and Status Register */
#define DMA_CH113_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012E3Cu)

/** Alias (User Manual Name) for DMA_CH113_CHCSR.
* To use register names with standard convension, please use DMA_CH113_CHCSR.
*/
#define	DMA_CHCSR113	(DMA_CH113_CHCSR)

/** \\brief  2E2C, DMA Channel Destination Address Register x */
#define DMA_CH113_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012E2Cu)

/** Alias (User Manual Name) for DMA_CH113_DADR.
* To use register names with standard convension, please use DMA_CH113_DADR.
*/
#define	DMA_DADR113	(DMA_CH113_DADR)

/** \\brief  2E20, DMA Channel Read Data CRC Register */
#define DMA_CH113_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012E20u)

/** Alias (User Manual Name) for DMA_CH113_RDCRCR.
* To use register names with standard convension, please use DMA_CH113_RDCRCR.
*/
#define	DMA_RDCRCR113	(DMA_CH113_RDCRCR)

/** \\brief  2E28, DMA Channel Source Address Register */
#define DMA_CH113_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012E28u)

/** Alias (User Manual Name) for DMA_CH113_SADR.
* To use register names with standard convension, please use DMA_CH113_SADR.
*/
#define	DMA_SADR113	(DMA_CH113_SADR)

/** \\brief  2E24, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH113_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012E24u)

/** Alias (User Manual Name) for DMA_CH113_SDCRCR.
* To use register names with standard convension, please use DMA_CH113_SDCRCR.
*/
#define	DMA_SDCRCR113	(DMA_CH113_SDCRCR)

/** \\brief  2E38, DMA Channel Shadow Address Register */
#define DMA_CH113_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012E38u)

/** Alias (User Manual Name) for DMA_CH113_SHADR.
* To use register names with standard convension, please use DMA_CH113_SHADR.
*/
#define	DMA_SHADR113	(DMA_CH113_SHADR)

/** \\brief  2E50, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH114_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012E50u)

/** Alias (User Manual Name) for DMA_CH114_ADICR.
* To use register names with standard convension, please use DMA_CH114_ADICR.
*/
#define	DMA_ADICR114	(DMA_CH114_ADICR)

/** \\brief  2E54, DMA Channel Configuration Register */
#define DMA_CH114_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012E54u)

/** Alias (User Manual Name) for DMA_CH114_CHCFGR.
* To use register names with standard convension, please use DMA_CH114_CHCFGR.
*/
#define	DMA_CHCFGR114	(DMA_CH114_CHCFGR)

/** \\brief  2E5C, DMARAM Channel Control and Status Register */
#define DMA_CH114_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012E5Cu)

/** Alias (User Manual Name) for DMA_CH114_CHCSR.
* To use register names with standard convension, please use DMA_CH114_CHCSR.
*/
#define	DMA_CHCSR114	(DMA_CH114_CHCSR)

/** \\brief  2E4C, DMA Channel Destination Address Register x */
#define DMA_CH114_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012E4Cu)

