keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH114_DADR.
* To use register names with standard convension, please use DMA_CH114_DADR.
*/
#define	DMA_DADR114	(DMA_CH114_DADR)

/** \\brief  2E40, DMA Channel Read Data CRC Register */
#define DMA_CH114_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012E40u)

/** Alias (User Manual Name) for DMA_CH114_RDCRCR.
* To use register names with standard convension, please use DMA_CH114_RDCRCR.
*/
#define	DMA_RDCRCR114	(DMA_CH114_RDCRCR)

/** \\brief  2E48, DMA Channel Source Address Register */
#define DMA_CH114_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012E48u)

/** Alias (User Manual Name) for DMA_CH114_SADR.
* To use register names with standard convension, please use DMA_CH114_SADR.
*/
#define	DMA_SADR114	(DMA_CH114_SADR)

/** \\brief  2E44, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH114_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012E44u)

/** Alias (User Manual Name) for DMA_CH114_SDCRCR.
* To use register names with standard convension, please use DMA_CH114_SDCRCR.
*/
#define	DMA_SDCRCR114	(DMA_CH114_SDCRCR)

/** \\brief  2E58, DMA Channel Shadow Address Register */
#define DMA_CH114_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012E58u)

/** Alias (User Manual Name) for DMA_CH114_SHADR.
* To use register names with standard convension, please use DMA_CH114_SHADR.
*/
#define	DMA_SHADR114	(DMA_CH114_SHADR)

/** \\brief  2E70, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH115_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012E70u)

/** Alias (User Manual Name) for DMA_CH115_ADICR.
* To use register names with standard convension, please use DMA_CH115_ADICR.
*/
#define	DMA_ADICR115	(DMA_CH115_ADICR)

/** \\brief  2E74, DMA Channel Configuration Register */
#define DMA_CH115_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012E74u)

/** Alias (User Manual Name) for DMA_CH115_CHCFGR.
* To use register names with standard convension, please use DMA_CH115_CHCFGR.
*/
#define	DMA_CHCFGR115	(DMA_CH115_CHCFGR)

/** \\brief  2E7C, DMARAM Channel Control and Status Register */
#define DMA_CH115_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012E7Cu)

/** Alias (User Manual Name) for DMA_CH115_CHCSR.
* To use register names with standard convension, please use DMA_CH115_CHCSR.
*/
#define	DMA_CHCSR115	(DMA_CH115_CHCSR)

/** \\brief  2E6C, DMA Channel Destination Address Register x */
#define DMA_CH115_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012E6Cu)

/** Alias (User Manual Name) for DMA_CH115_DADR.
* To use register names with standard convension, please use DMA_CH115_DADR.
*/
#define	DMA_DADR115	(DMA_CH115_DADR)

/** \\brief  2E60, DMA Channel Read Data CRC Register */
#define DMA_CH115_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012E60u)

/** Alias (User Manual Name) for DMA_CH115_RDCRCR.
* To use register names with standard convension, please use DMA_CH115_RDCRCR.
*/
#define	DMA_RDCRCR115	(DMA_CH115_RDCRCR)

/** \\brief  2E68, DMA Channel Source Address Register */
#define DMA_CH115_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012E68u)

/** Alias (User Manual Name) for DMA_CH115_SADR.
* To use register names with standard convension, please use DMA_CH115_SADR.
*/
#define	DMA_SADR115	(DMA_CH115_SADR)

/** \\brief  2E64, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH115_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012E64u)

/** Alias (User Manual Name) for DMA_CH115_SDCRCR.
* To use register names with standard convension, please use DMA_CH115_SDCRCR.
*/
#define	DMA_SDCRCR115	(DMA_CH115_SDCRCR)

/** \\brief  2E78, DMA Channel Shadow Address Register */
#define DMA_CH115_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012E78u)

/** Alias (User Manual Name) for DMA_CH115_SHADR.
* To use register names with standard convension, please use DMA_CH115_SHADR.
*/
#define	DMA_SHADR115	(DMA_CH115_SHADR)

/** \\brief  2E90, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH116_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012E90u)

/** Alias (User Manual Name) for DMA_CH116_ADICR.
* To use register names with standard convension, please use DMA_CH116_ADICR.
*/
#define	DMA_ADICR116	(DMA_CH116_ADICR)

/** \\brief  2E94, DMA Channel Configuration Register */
#define DMA_CH116_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012E94u)

/** Alias (User Manual Name) for DMA_CH116_CHCFGR.
* To use register names with standard convension, please use DMA_CH116_CHCFGR.
*/
#define	DMA_CHCFGR116	(DMA_CH116_CHCFGR)

/** \\brief  2E9C, DMARAM Channel Control and Status Register */
#define DMA_CH116_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012E9Cu)

/** Alias (User Manual Name) for DMA_CH116_CHCSR.
* To use register names with standard convension, please use DMA_CH116_CHCSR.
*/
#define	DMA_CHCSR116	(DMA_CH116_CHCSR)

/** \\brief  2E8C, DMA Channel Destination Address Register x */
#define DMA_CH116_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012E8Cu)

/** Alias (User Manual Name) for DMA_CH116_DADR.
* To use register names with standard convension, please use DMA_CH116_DADR.
*/
#define	DMA_DADR116	(DMA_CH116_DADR)

/** \\brief  2E80, DMA Channel Read Data CRC Register */
#define DMA_CH116_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012E80u)

/** Alias (User Manual Name) for DMA_CH116_RDCRCR.
* To use register names with standard convension, please use DMA_CH116_RDCRCR.
*/
#define	DMA_RDCRCR116	(DMA_CH116_RDCRCR)

/** \\brief  2E88, DMA Channel Source Address Register */
#define DMA_CH116_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012E88u)

/** Alias (User Manual Name) for DMA_CH116_SADR.
* To use register names with standard convension, please use DMA_CH116_SADR.
*/
#define	DMA_SADR116	(DMA_CH116_SADR)

/** \\brief  2E84, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH116_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012E84u)

