keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH116_SDCRCR.
* To use register names with standard convension, please use DMA_CH116_SDCRCR.
*/
#define	DMA_SDCRCR116	(DMA_CH116_SDCRCR)

/** \\brief  2E98, DMA Channel Shadow Address Register */
#define DMA_CH116_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012E98u)

/** Alias (User Manual Name) for DMA_CH116_SHADR.
* To use register names with standard convension, please use DMA_CH116_SHADR.
*/
#define	DMA_SHADR116	(DMA_CH116_SHADR)

/** \\brief  2EB0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH117_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012EB0u)

/** Alias (User Manual Name) for DMA_CH117_ADICR.
* To use register names with standard convension, please use DMA_CH117_ADICR.
*/
#define	DMA_ADICR117	(DMA_CH117_ADICR)

/** \\brief  2EB4, DMA Channel Configuration Register */
#define DMA_CH117_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012EB4u)

/** Alias (User Manual Name) for DMA_CH117_CHCFGR.
* To use register names with standard convension, please use DMA_CH117_CHCFGR.
*/
#define	DMA_CHCFGR117	(DMA_CH117_CHCFGR)

/** \\brief  2EBC, DMARAM Channel Control and Status Register */
#define DMA_CH117_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012EBCu)

/** Alias (User Manual Name) for DMA_CH117_CHCSR.
* To use register names with standard convension, please use DMA_CH117_CHCSR.
*/
#define	DMA_CHCSR117	(DMA_CH117_CHCSR)

/** \\brief  2EAC, DMA Channel Destination Address Register x */
#define DMA_CH117_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012EACu)

/** Alias (User Manual Name) for DMA_CH117_DADR.
* To use register names with standard convension, please use DMA_CH117_DADR.
*/
#define	DMA_DADR117	(DMA_CH117_DADR)

/** \\brief  2EA0, DMA Channel Read Data CRC Register */
#define DMA_CH117_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012EA0u)

/** Alias (User Manual Name) for DMA_CH117_RDCRCR.
* To use register names with standard convension, please use DMA_CH117_RDCRCR.
*/
#define	DMA_RDCRCR117	(DMA_CH117_RDCRCR)

/** \\brief  2EA8, DMA Channel Source Address Register */
#define DMA_CH117_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012EA8u)

/** Alias (User Manual Name) for DMA_CH117_SADR.
* To use register names with standard convension, please use DMA_CH117_SADR.
*/
#define	DMA_SADR117	(DMA_CH117_SADR)

/** \\brief  2EA4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH117_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012EA4u)

/** Alias (User Manual Name) for DMA_CH117_SDCRCR.
* To use register names with standard convension, please use DMA_CH117_SDCRCR.
*/
#define	DMA_SDCRCR117	(DMA_CH117_SDCRCR)

/** \\brief  2EB8, DMA Channel Shadow Address Register */
#define DMA_CH117_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012EB8u)

/** Alias (User Manual Name) for DMA_CH117_SHADR.
* To use register names with standard convension, please use DMA_CH117_SHADR.
*/
#define	DMA_SHADR117	(DMA_CH117_SHADR)

/** \\brief  2ED0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH118_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012ED0u)

/** Alias (User Manual Name) for DMA_CH118_ADICR.
* To use register names with standard convension, please use DMA_CH118_ADICR.
*/
#define	DMA_ADICR118	(DMA_CH118_ADICR)

/** \\brief  2ED4, DMA Channel Configuration Register */
#define DMA_CH118_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012ED4u)

/** Alias (User Manual Name) for DMA_CH118_CHCFGR.
* To use register names with standard convension, please use DMA_CH118_CHCFGR.
*/
#define	DMA_CHCFGR118	(DMA_CH118_CHCFGR)

/** \\brief  2EDC, DMARAM Channel Control and Status Register */
#define DMA_CH118_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012EDCu)

/** Alias (User Manual Name) for DMA_CH118_CHCSR.
* To use register names with standard convension, please use DMA_CH118_CHCSR.
*/
#define	DMA_CHCSR118	(DMA_CH118_CHCSR)

/** \\brief  2ECC, DMA Channel Destination Address Register x */
#define DMA_CH118_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012ECCu)

/** Alias (User Manual Name) for DMA_CH118_DADR.
* To use register names with standard convension, please use DMA_CH118_DADR.
*/
#define	DMA_DADR118	(DMA_CH118_DADR)

/** \\brief  2EC0, DMA Channel Read Data CRC Register */
#define DMA_CH118_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012EC0u)

/** Alias (User Manual Name) for DMA_CH118_RDCRCR.
* To use register names with standard convension, please use DMA_CH118_RDCRCR.
*/
#define	DMA_RDCRCR118	(DMA_CH118_RDCRCR)

/** \\brief  2EC8, DMA Channel Source Address Register */
#define DMA_CH118_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012EC8u)

/** Alias (User Manual Name) for DMA_CH118_SADR.
* To use register names with standard convension, please use DMA_CH118_SADR.
*/
#define	DMA_SADR118	(DMA_CH118_SADR)

/** \\brief  2EC4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH118_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012EC4u)

/** Alias (User Manual Name) for DMA_CH118_SDCRCR.
* To use register names with standard convension, please use DMA_CH118_SDCRCR.
*/
#define	DMA_SDCRCR118	(DMA_CH118_SDCRCR)

/** \\brief  2ED8, DMA Channel Shadow Address Register */
#define DMA_CH118_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012ED8u)

/** Alias (User Manual Name) for DMA_CH118_SHADR.
* To use register names with standard convension, please use DMA_CH118_SHADR.
*/
#define	DMA_SHADR118	(DMA_CH118_SHADR)

/** \\brief  2EF0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH119_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012EF0u)

/** Alias (User Manual Name) for DMA_CH119_ADICR.
* To use register names with standard convension, please use DMA_CH119_ADICR.
*/
#define	DMA_ADICR119	(DMA_CH119_ADICR)

/** \\brief  2EF4, DMA Channel Configuration Register */
#define DMA_CH119_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012EF4u)

