keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  2F00, DMA Channel Read Data CRC Register */
#define DMA_CH120_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012F00u)

/** Alias (User Manual Name) for DMA_CH120_RDCRCR.
* To use register names with standard convension, please use DMA_CH120_RDCRCR.
*/
#define	DMA_RDCRCR120	(DMA_CH120_RDCRCR)

/** \\brief  2F08, DMA Channel Source Address Register */
#define DMA_CH120_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F08u)

/** Alias (User Manual Name) for DMA_CH120_SADR.
* To use register names with standard convension, please use DMA_CH120_SADR.
*/
#define	DMA_SADR120	(DMA_CH120_SADR)

/** \\brief  2F04, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH120_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F04u)

/** Alias (User Manual Name) for DMA_CH120_SDCRCR.
* To use register names with standard convension, please use DMA_CH120_SDCRCR.
*/
#define	DMA_SDCRCR120	(DMA_CH120_SDCRCR)

/** \\brief  2F18, DMA Channel Shadow Address Register */
#define DMA_CH120_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F18u)

/** Alias (User Manual Name) for DMA_CH120_SHADR.
* To use register names with standard convension, please use DMA_CH120_SHADR.
*/
#define	DMA_SHADR120	(DMA_CH120_SHADR)

/** \\brief  2F30, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH121_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F30u)

/** Alias (User Manual Name) for DMA_CH121_ADICR.
* To use register names with standard convension, please use DMA_CH121_ADICR.
*/
#define	DMA_ADICR121	(DMA_CH121_ADICR)

/** \\brief  2F34, DMA Channel Configuration Register */
#define DMA_CH121_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012F34u)

/** Alias (User Manual Name) for DMA_CH121_CHCFGR.
* To use register names with standard convension, please use DMA_CH121_CHCFGR.
*/
#define	DMA_CHCFGR121	(DMA_CH121_CHCFGR)

/** \\brief  2F3C, DMARAM Channel Control and Status Register */
#define DMA_CH121_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012F3Cu)

/** Alias (User Manual Name) for DMA_CH121_CHCSR.
* To use register names with standard convension, please use DMA_CH121_CHCSR.
*/
#define	DMA_CHCSR121	(DMA_CH121_CHCSR)

/** \\brief  2F2C, DMA Channel Destination Address Register x */
#define DMA_CH121_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012F2Cu)

/** Alias (User Manual Name) for DMA_CH121_DADR.
* To use register names with standard convension, please use DMA_CH121_DADR.
*/
#define	DMA_DADR121	(DMA_CH121_DADR)

/** \\brief  2F20, DMA Channel Read Data CRC Register */
#define DMA_CH121_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012F20u)

/** Alias (User Manual Name) for DMA_CH121_RDCRCR.
* To use register names with standard convension, please use DMA_CH121_RDCRCR.
*/
#define	DMA_RDCRCR121	(DMA_CH121_RDCRCR)

/** \\brief  2F28, DMA Channel Source Address Register */
#define DMA_CH121_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F28u)

/** Alias (User Manual Name) for DMA_CH121_SADR.
* To use register names with standard convension, please use DMA_CH121_SADR.
*/
#define	DMA_SADR121	(DMA_CH121_SADR)

/** \\brief  2F24, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH121_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F24u)

/** Alias (User Manual Name) for DMA_CH121_SDCRCR.
* To use register names with standard convension, please use DMA_CH121_SDCRCR.
*/
#define	DMA_SDCRCR121	(DMA_CH121_SDCRCR)

/** \\brief  2F38, DMA Channel Shadow Address Register */
#define DMA_CH121_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F38u)

/** Alias (User Manual Name) for DMA_CH121_SHADR.
* To use register names with standard convension, please use DMA_CH121_SHADR.
*/
#define	DMA_SHADR121	(DMA_CH121_SHADR)

/** \\brief  2F50, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH122_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F50u)

/** Alias (User Manual Name) for DMA_CH122_ADICR.
* To use register names with standard convension, please use DMA_CH122_ADICR.
*/
#define	DMA_ADICR122	(DMA_CH122_ADICR)

/** \\brief  2F54, DMA Channel Configuration Register */
#define DMA_CH122_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012F54u)

/** Alias (User Manual Name) for DMA_CH122_CHCFGR.
* To use register names with standard convension, please use DMA_CH122_CHCFGR.
*/
#define	DMA_CHCFGR122	(DMA_CH122_CHCFGR)

/** \\brief  2F5C, DMARAM Channel Control and Status Register */
#define DMA_CH122_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012F5Cu)

/** Alias (User Manual Name) for DMA_CH122_CHCSR.
* To use register names with standard convension, please use DMA_CH122_CHCSR.
*/
#define	DMA_CHCSR122	(DMA_CH122_CHCSR)

/** \\brief  2F4C, DMA Channel Destination Address Register x */
#define DMA_CH122_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012F4Cu)

/** Alias (User Manual Name) for DMA_CH122_DADR.
* To use register names with standard convension, please use DMA_CH122_DADR.
*/
#define	DMA_DADR122	(DMA_CH122_DADR)

/** \\brief  2F40, DMA Channel Read Data CRC Register */
#define DMA_CH122_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012F40u)

/** Alias (User Manual Name) for DMA_CH122_RDCRCR.
* To use register names with standard convension, please use DMA_CH122_RDCRCR.
*/
#define	DMA_RDCRCR122	(DMA_CH122_RDCRCR)

/** \\brief  2F48, DMA Channel Source Address Register */
#define DMA_CH122_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F48u)

/** Alias (User Manual Name) for DMA_CH122_SADR.
* To use register names with standard convension, please use DMA_CH122_SADR.
*/
#define	DMA_SADR122	(DMA_CH122_SADR)

/** \\brief  2F44, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH122_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F44u)

/** Alias (User Manual Name) for DMA_CH122_SDCRCR.
* To use register names with standard convension, please use DMA_CH122_SDCRCR.
*/
#define	DMA_SDCRCR122	(DMA_CH122_SDCRCR)

/** \\brief  2F58, DMA Channel Shadow Address Register */
#define DMA_CH122_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F58u)

/** Alias (User Manual Name) for DMA_CH122_SHADR.
* To use register names with standard convension, please use DMA_CH122_SHADR.
*/
#define	DMA_SHADR122	(DMA_CH122_SHADR)

/** \\brief  2F70, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH123_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F70u)

