keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH16_SADR.
* To use register names with standard convension, please use DMA_CH16_SADR.
*/
#define	DMA_SADR016	(DMA_CH16_SADR)

/** \\brief  2204, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH16_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012204u)

/** Alias (User Manual Name) for DMA_CH16_SDCRCR.
* To use register names with standard convension, please use DMA_CH16_SDCRCR.
*/
#define	DMA_SDCRCR016	(DMA_CH16_SDCRCR)

/** \\brief  2218, DMA Channel Shadow Address Register */
#define DMA_CH16_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012218u)

/** Alias (User Manual Name) for DMA_CH16_SHADR.
* To use register names with standard convension, please use DMA_CH16_SHADR.
*/
#define	DMA_SHADR016	(DMA_CH16_SHADR)

/** \\brief  2230, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH17_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012230u)

/** Alias (User Manual Name) for DMA_CH17_ADICR.
* To use register names with standard convension, please use DMA_CH17_ADICR.
*/
#define	DMA_ADICR017	(DMA_CH17_ADICR)

/** \\brief  2234, DMA Channel Configuration Register */
#define DMA_CH17_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012234u)

/** Alias (User Manual Name) for DMA_CH17_CHCFGR.
* To use register names with standard convension, please use DMA_CH17_CHCFGR.
*/
#define	DMA_CHCFGR017	(DMA_CH17_CHCFGR)

/** \\brief  223C, DMARAM Channel Control and Status Register */
#define DMA_CH17_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001223Cu)

/** Alias (User Manual Name) for DMA_CH17_CHCSR.
* To use register names with standard convension, please use DMA_CH17_CHCSR.
*/
#define	DMA_CHCSR017	(DMA_CH17_CHCSR)

/** \\brief  222C, DMA Channel Destination Address Register x */
#define DMA_CH17_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001222Cu)

/** Alias (User Manual Name) for DMA_CH17_DADR.
* To use register names with standard convension, please use DMA_CH17_DADR.
*/
#define	DMA_DADR017	(DMA_CH17_DADR)

/** \\brief  2220, DMA Channel Read Data CRC Register */
#define DMA_CH17_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012220u)

/** Alias (User Manual Name) for DMA_CH17_RDCRCR.
* To use register names with standard convension, please use DMA_CH17_RDCRCR.
*/
#define	DMA_RDCRCR017	(DMA_CH17_RDCRCR)

/** \\brief  2228, DMA Channel Source Address Register */
#define DMA_CH17_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012228u)

/** Alias (User Manual Name) for DMA_CH17_SADR.
* To use register names with standard convension, please use DMA_CH17_SADR.
*/
#define	DMA_SADR017	(DMA_CH17_SADR)

/** \\brief  2224, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH17_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012224u)

/** Alias (User Manual Name) for DMA_CH17_SDCRCR.
* To use register names with standard convension, please use DMA_CH17_SDCRCR.
*/
#define	DMA_SDCRCR017	(DMA_CH17_SDCRCR)

/** \\brief  2238, DMA Channel Shadow Address Register */
#define DMA_CH17_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012238u)

/** Alias (User Manual Name) for DMA_CH17_SHADR.
* To use register names with standard convension, please use DMA_CH17_SHADR.
*/
#define	DMA_SHADR017	(DMA_CH17_SHADR)

/** \\brief  2250, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH18_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012250u)

/** Alias (User Manual Name) for DMA_CH18_ADICR.
* To use register names with standard convension, please use DMA_CH18_ADICR.
*/
#define	DMA_ADICR018	(DMA_CH18_ADICR)

/** \\brief  2254, DMA Channel Configuration Register */
#define DMA_CH18_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012254u)

/** Alias (User Manual Name) for DMA_CH18_CHCFGR.
* To use register names with standard convension, please use DMA_CH18_CHCFGR.
*/
#define	DMA_CHCFGR018	(DMA_CH18_CHCFGR)

/** \\brief  225C, DMARAM Channel Control and Status Register */
#define DMA_CH18_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001225Cu)

/** Alias (User Manual Name) for DMA_CH18_CHCSR.
* To use register names with standard convension, please use DMA_CH18_CHCSR.
*/
#define	DMA_CHCSR018	(DMA_CH18_CHCSR)

/** \\brief  224C, DMA Channel Destination Address Register x */
#define DMA_CH18_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001224Cu)

/** Alias (User Manual Name) for DMA_CH18_DADR.
* To use register names with standard convension, please use DMA_CH18_DADR.
*/
#define	DMA_DADR018	(DMA_CH18_DADR)

/** \\brief  2240, DMA Channel Read Data CRC Register */
#define DMA_CH18_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012240u)

/** Alias (User Manual Name) for DMA_CH18_RDCRCR.
* To use register names with standard convension, please use DMA_CH18_RDCRCR.
*/
#define	DMA_RDCRCR018	(DMA_CH18_RDCRCR)

/** \\brief  2248, DMA Channel Source Address Register */
#define DMA_CH18_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012248u)

/** Alias (User Manual Name) for DMA_CH18_SADR.
* To use register names with standard convension, please use DMA_CH18_SADR.
*/
#define	DMA_SADR018	(DMA_CH18_SADR)

/** \\brief  2244, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH18_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012244u)

/** Alias (User Manual Name) for DMA_CH18_SDCRCR.
* To use register names with standard convension, please use DMA_CH18_SDCRCR.
*/
#define	DMA_SDCRCR018	(DMA_CH18_SDCRCR)

/** \\brief  2258, DMA Channel Shadow Address Register */
#define DMA_CH18_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012258u)

/** Alias (User Manual Name) for DMA_CH18_SHADR.
* To use register names with standard convension, please use DMA_CH18_SHADR.
*/
#define	DMA_SHADR018	(DMA_CH18_SHADR)

/** \\brief  2270, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH19_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012270u)

/** Alias (User Manual Name) for DMA_CH19_ADICR.
* To use register names with standard convension, please use DMA_CH19_ADICR.
*/
#define	DMA_ADICR019	(DMA_CH19_ADICR)

/** \\brief  2274, DMA Channel Configuration Register */
#define DMA_CH19_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012274u)

/** Alias (User Manual Name) for DMA_CH19_CHCFGR.
* To use register names with standard convension, please use DMA_CH19_CHCFGR.
*/
#define	DMA_CHCFGR019	(DMA_CH19_CHCFGR)

/** \\brief  227C, DMARAM Channel Control and Status Register */
#define DMA_CH19_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001227Cu)

/** Alias (User Manual Name) for DMA_CH19_CHCSR.
* To use register names with standard convension, please use DMA_CH19_CHCSR.
*/
#define	DMA_CHCSR019	(DMA_CH19_CHCSR)

/** \\brief  226C, DMA Channel Destination Address Register x */
#define DMA_CH19_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001226Cu)

/** Alias (User Manual Name) for DMA_CH19_DADR.
* To use register names with standard convension, please use DMA_CH19_DADR.
*/
#define	DMA_DADR019	(DMA_CH19_DADR)

