keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  22B8, DMA Channel Shadow Address Register */
#define DMA_CH21_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00122B8u)

/** Alias (User Manual Name) for DMA_CH21_SHADR.
* To use register names with standard convension, please use DMA_CH21_SHADR.
*/
#define	DMA_SHADR021	(DMA_CH21_SHADR)

/** \\brief  22D0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH22_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00122D0u)

/** Alias (User Manual Name) for DMA_CH22_ADICR.
* To use register names with standard convension, please use DMA_CH22_ADICR.
*/
#define	DMA_ADICR022	(DMA_CH22_ADICR)

/** \\brief  22D4, DMA Channel Configuration Register */
#define DMA_CH22_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00122D4u)

/** Alias (User Manual Name) for DMA_CH22_CHCFGR.
* To use register names with standard convension, please use DMA_CH22_CHCFGR.
*/
#define	DMA_CHCFGR022	(DMA_CH22_CHCFGR)

/** \\brief  22DC, DMARAM Channel Control and Status Register */
#define DMA_CH22_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00122DCu)

/** Alias (User Manual Name) for DMA_CH22_CHCSR.
* To use register names with standard convension, please use DMA_CH22_CHCSR.
*/
#define	DMA_CHCSR022	(DMA_CH22_CHCSR)

/** \\brief  22CC, DMA Channel Destination Address Register x */
#define DMA_CH22_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00122CCu)

/** Alias (User Manual Name) for DMA_CH22_DADR.
* To use register names with standard convension, please use DMA_CH22_DADR.
*/
#define	DMA_DADR022	(DMA_CH22_DADR)

/** \\brief  22C0, DMA Channel Read Data CRC Register */
#define DMA_CH22_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00122C0u)

/** Alias (User Manual Name) for DMA_CH22_RDCRCR.
* To use register names with standard convension, please use DMA_CH22_RDCRCR.
*/
#define	DMA_RDCRCR022	(DMA_CH22_RDCRCR)

/** \\brief  22C8, DMA Channel Source Address Register */
#define DMA_CH22_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00122C8u)

/** Alias (User Manual Name) for DMA_CH22_SADR.
* To use register names with standard convension, please use DMA_CH22_SADR.
*/
#define	DMA_SADR022	(DMA_CH22_SADR)

/** \\brief  22C4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH22_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00122C4u)

/** Alias (User Manual Name) for DMA_CH22_SDCRCR.
* To use register names with standard convension, please use DMA_CH22_SDCRCR.
*/
#define	DMA_SDCRCR022	(DMA_CH22_SDCRCR)

/** \\brief  22D8, DMA Channel Shadow Address Register */
#define DMA_CH22_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00122D8u)

/** Alias (User Manual Name) for DMA_CH22_SHADR.
* To use register names with standard convension, please use DMA_CH22_SHADR.
*/
#define	DMA_SHADR022	(DMA_CH22_SHADR)

/** \\brief  22F0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH23_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00122F0u)

/** Alias (User Manual Name) for DMA_CH23_ADICR.
* To use register names with standard convension, please use DMA_CH23_ADICR.
*/
#define	DMA_ADICR023	(DMA_CH23_ADICR)

/** \\brief  22F4, DMA Channel Configuration Register */
#define DMA_CH23_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00122F4u)

/** Alias (User Manual Name) for DMA_CH23_CHCFGR.
* To use register names with standard convension, please use DMA_CH23_CHCFGR.
*/
#define	DMA_CHCFGR023	(DMA_CH23_CHCFGR)

/** \\brief  22FC, DMARAM Channel Control and Status Register */
#define DMA_CH23_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00122FCu)

/** Alias (User Manual Name) for DMA_CH23_CHCSR.
* To use register names with standard convension, please use DMA_CH23_CHCSR.
*/
#define	DMA_CHCSR023	(DMA_CH23_CHCSR)

/** \\brief  22EC, DMA Channel Destination Address Register x */
#define DMA_CH23_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00122ECu)

/** Alias (User Manual Name) for DMA_CH23_DADR.
* To use register names with standard convension, please use DMA_CH23_DADR.
*/
#define	DMA_DADR023	(DMA_CH23_DADR)

/** \\brief  22E0, DMA Channel Read Data CRC Register */
#define DMA_CH23_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00122E0u)

/** Alias (User Manual Name) for DMA_CH23_RDCRCR.
* To use register names with standard convension, please use DMA_CH23_RDCRCR.
*/
#define	DMA_RDCRCR023	(DMA_CH23_RDCRCR)

/** \\brief  22E8, DMA Channel Source Address Register */
#define DMA_CH23_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00122E8u)

/** Alias (User Manual Name) for DMA_CH23_SADR.
* To use register names with standard convension, please use DMA_CH23_SADR.
*/
#define	DMA_SADR023	(DMA_CH23_SADR)

/** \\brief  22E4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH23_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00122E4u)

/** Alias (User Manual Name) for DMA_CH23_SDCRCR.
* To use register names with standard convension, please use DMA_CH23_SDCRCR.
*/
#define	DMA_SDCRCR023	(DMA_CH23_SDCRCR)

/** \\brief  22F8, DMA Channel Shadow Address Register */
#define DMA_CH23_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00122F8u)

/** Alias (User Manual Name) for DMA_CH23_SHADR.
* To use register names with standard convension, please use DMA_CH23_SHADR.
*/
#define	DMA_SHADR023	(DMA_CH23_SHADR)

/** \\brief  2310, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH24_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012310u)

/** Alias (User Manual Name) for DMA_CH24_ADICR.
* To use register names with standard convension, please use DMA_CH24_ADICR.
*/
#define	DMA_ADICR024	(DMA_CH24_ADICR)

/** \\brief  2314, DMA Channel Configuration Register */
#define DMA_CH24_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012314u)

/** Alias (User Manual Name) for DMA_CH24_CHCFGR.
* To use register names with standard convension, please use DMA_CH24_CHCFGR.
*/
#define	DMA_CHCFGR024	(DMA_CH24_CHCFGR)

/** \\brief  231C, DMARAM Channel Control and Status Register */
#define DMA_CH24_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001231Cu)

/** Alias (User Manual Name) for DMA_CH24_CHCSR.
* To use register names with standard convension, please use DMA_CH24_CHCSR.
*/
#define	DMA_CHCSR024	(DMA_CH24_CHCSR)

/** \\brief  230C, DMA Channel Destination Address Register x */
#define DMA_CH24_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001230Cu)

