keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH24_DADR.
* To use register names with standard convension, please use DMA_CH24_DADR.
*/
#define	DMA_DADR024	(DMA_CH24_DADR)

/** \\brief  2300, DMA Channel Read Data CRC Register */
#define DMA_CH24_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012300u)

/** Alias (User Manual Name) for DMA_CH24_RDCRCR.
* To use register names with standard convension, please use DMA_CH24_RDCRCR.
*/
#define	DMA_RDCRCR024	(DMA_CH24_RDCRCR)

/** \\brief  2308, DMA Channel Source Address Register */
#define DMA_CH24_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012308u)

/** Alias (User Manual Name) for DMA_CH24_SADR.
* To use register names with standard convension, please use DMA_CH24_SADR.
*/
#define	DMA_SADR024	(DMA_CH24_SADR)

/** \\brief  2304, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH24_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012304u)

/** Alias (User Manual Name) for DMA_CH24_SDCRCR.
* To use register names with standard convension, please use DMA_CH24_SDCRCR.
*/
#define	DMA_SDCRCR024	(DMA_CH24_SDCRCR)

/** \\brief  2318, DMA Channel Shadow Address Register */
#define DMA_CH24_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012318u)

/** Alias (User Manual Name) for DMA_CH24_SHADR.
* To use register names with standard convension, please use DMA_CH24_SHADR.
*/
#define	DMA_SHADR024	(DMA_CH24_SHADR)

/** \\brief  2330, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH25_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012330u)

/** Alias (User Manual Name) for DMA_CH25_ADICR.
* To use register names with standard convension, please use DMA_CH25_ADICR.
*/
#define	DMA_ADICR025	(DMA_CH25_ADICR)

/** \\brief  2334, DMA Channel Configuration Register */
#define DMA_CH25_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012334u)

/** Alias (User Manual Name) for DMA_CH25_CHCFGR.
* To use register names with standard convension, please use DMA_CH25_CHCFGR.
*/
#define	DMA_CHCFGR025	(DMA_CH25_CHCFGR)

/** \\brief  233C, DMARAM Channel Control and Status Register */
#define DMA_CH25_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001233Cu)

/** Alias (User Manual Name) for DMA_CH25_CHCSR.
* To use register names with standard convension, please use DMA_CH25_CHCSR.
*/
#define	DMA_CHCSR025	(DMA_CH25_CHCSR)

/** \\brief  232C, DMA Channel Destination Address Register x */
#define DMA_CH25_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001232Cu)

/** Alias (User Manual Name) for DMA_CH25_DADR.
* To use register names with standard convension, please use DMA_CH25_DADR.
*/
#define	DMA_DADR025	(DMA_CH25_DADR)

/** \\brief  2320, DMA Channel Read Data CRC Register */
#define DMA_CH25_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012320u)

/** Alias (User Manual Name) for DMA_CH25_RDCRCR.
* To use register names with standard convension, please use DMA_CH25_RDCRCR.
*/
#define	DMA_RDCRCR025	(DMA_CH25_RDCRCR)

/** \\brief  2328, DMA Channel Source Address Register */
#define DMA_CH25_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012328u)

/** Alias (User Manual Name) for DMA_CH25_SADR.
* To use register names with standard convension, please use DMA_CH25_SADR.
*/
#define	DMA_SADR025	(DMA_CH25_SADR)

/** \\brief  2324, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH25_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012324u)

/** Alias (User Manual Name) for DMA_CH25_SDCRCR.
* To use register names with standard convension, please use DMA_CH25_SDCRCR.
*/
#define	DMA_SDCRCR025	(DMA_CH25_SDCRCR)

/** \\brief  2338, DMA Channel Shadow Address Register */
#define DMA_CH25_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012338u)

/** Alias (User Manual Name) for DMA_CH25_SHADR.
* To use register names with standard convension, please use DMA_CH25_SHADR.
*/
#define	DMA_SHADR025	(DMA_CH25_SHADR)

/** \\brief  2350, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH26_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012350u)

/** Alias (User Manual Name) for DMA_CH26_ADICR.
* To use register names with standard convension, please use DMA_CH26_ADICR.
*/
#define	DMA_ADICR026	(DMA_CH26_ADICR)

/** \\brief  2354, DMA Channel Configuration Register */
#define DMA_CH26_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012354u)

/** Alias (User Manual Name) for DMA_CH26_CHCFGR.
* To use register names with standard convension, please use DMA_CH26_CHCFGR.
*/
#define	DMA_CHCFGR026	(DMA_CH26_CHCFGR)

/** \\brief  235C, DMARAM Channel Control and Status Register */
#define DMA_CH26_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001235Cu)

/** Alias (User Manual Name) for DMA_CH26_CHCSR.
* To use register names with standard convension, please use DMA_CH26_CHCSR.
*/
#define	DMA_CHCSR026	(DMA_CH26_CHCSR)

/** \\brief  234C, DMA Channel Destination Address Register x */
#define DMA_CH26_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001234Cu)

/** Alias (User Manual Name) for DMA_CH26_DADR.
* To use register names with standard convension, please use DMA_CH26_DADR.
*/
#define	DMA_DADR026	(DMA_CH26_DADR)

/** \\brief  2340, DMA Channel Read Data CRC Register */
#define DMA_CH26_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012340u)

/** Alias (User Manual Name) for DMA_CH26_RDCRCR.
* To use register names with standard convension, please use DMA_CH26_RDCRCR.
*/
#define	DMA_RDCRCR026	(DMA_CH26_RDCRCR)

/** \\brief  2348, DMA Channel Source Address Register */
#define DMA_CH26_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012348u)

/** Alias (User Manual Name) for DMA_CH26_SADR.
* To use register names with standard convension, please use DMA_CH26_SADR.
*/
#define	DMA_SADR026	(DMA_CH26_SADR)

/** \\brief  2344, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH26_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012344u)

/** Alias (User Manual Name) for DMA_CH26_SDCRCR.
* To use register names with standard convension, please use DMA_CH26_SDCRCR.
*/
#define	DMA_SDCRCR026	(DMA_CH26_SDCRCR)

/** \\brief  2358, DMA Channel Shadow Address Register */
#define DMA_CH26_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012358u)

/** Alias (User Manual Name) for DMA_CH26_SHADR.
* To use register names with standard convension, please use DMA_CH26_SHADR.
*/
#define	DMA_SHADR026	(DMA_CH26_SHADR)

/** \\brief  2370, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH27_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012370u)

