keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH27_ADICR.
* To use register names with standard convension, please use DMA_CH27_ADICR.
*/
#define	DMA_ADICR027	(DMA_CH27_ADICR)

/** \\brief  2374, DMA Channel Configuration Register */
#define DMA_CH27_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012374u)

/** Alias (User Manual Name) for DMA_CH27_CHCFGR.
* To use register names with standard convension, please use DMA_CH27_CHCFGR.
*/
#define	DMA_CHCFGR027	(DMA_CH27_CHCFGR)

/** \\brief  237C, DMARAM Channel Control and Status Register */
#define DMA_CH27_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001237Cu)

/** Alias (User Manual Name) for DMA_CH27_CHCSR.
* To use register names with standard convension, please use DMA_CH27_CHCSR.
*/
#define	DMA_CHCSR027	(DMA_CH27_CHCSR)

/** \\brief  236C, DMA Channel Destination Address Register x */
#define DMA_CH27_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001236Cu)

/** Alias (User Manual Name) for DMA_CH27_DADR.
* To use register names with standard convension, please use DMA_CH27_DADR.
*/
#define	DMA_DADR027	(DMA_CH27_DADR)

/** \\brief  2360, DMA Channel Read Data CRC Register */
#define DMA_CH27_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012360u)

/** Alias (User Manual Name) for DMA_CH27_RDCRCR.
* To use register names with standard convension, please use DMA_CH27_RDCRCR.
*/
#define	DMA_RDCRCR027	(DMA_CH27_RDCRCR)

/** \\brief  2368, DMA Channel Source Address Register */
#define DMA_CH27_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012368u)

/** Alias (User Manual Name) for DMA_CH27_SADR.
* To use register names with standard convension, please use DMA_CH27_SADR.
*/
#define	DMA_SADR027	(DMA_CH27_SADR)

/** \\brief  2364, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH27_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012364u)

/** Alias (User Manual Name) for DMA_CH27_SDCRCR.
* To use register names with standard convension, please use DMA_CH27_SDCRCR.
*/
#define	DMA_SDCRCR027	(DMA_CH27_SDCRCR)

/** \\brief  2378, DMA Channel Shadow Address Register */
#define DMA_CH27_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012378u)

/** Alias (User Manual Name) for DMA_CH27_SHADR.
* To use register names with standard convension, please use DMA_CH27_SHADR.
*/
#define	DMA_SHADR027	(DMA_CH27_SHADR)

/** \\brief  2390, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH28_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012390u)

/** Alias (User Manual Name) for DMA_CH28_ADICR.
* To use register names with standard convension, please use DMA_CH28_ADICR.
*/
#define	DMA_ADICR028	(DMA_CH28_ADICR)

/** \\brief  2394, DMA Channel Configuration Register */
#define DMA_CH28_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012394u)

/** Alias (User Manual Name) for DMA_CH28_CHCFGR.
* To use register names with standard convension, please use DMA_CH28_CHCFGR.
*/
#define	DMA_CHCFGR028	(DMA_CH28_CHCFGR)

/** \\brief  239C, DMARAM Channel Control and Status Register */
#define DMA_CH28_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001239Cu)

/** Alias (User Manual Name) for DMA_CH28_CHCSR.
* To use register names with standard convension, please use DMA_CH28_CHCSR.
*/
#define	DMA_CHCSR028	(DMA_CH28_CHCSR)

/** \\brief  238C, DMA Channel Destination Address Register x */
#define DMA_CH28_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001238Cu)

/** Alias (User Manual Name) for DMA_CH28_DADR.
* To use register names with standard convension, please use DMA_CH28_DADR.
*/
#define	DMA_DADR028	(DMA_CH28_DADR)

/** \\brief  2380, DMA Channel Read Data CRC Register */
#define DMA_CH28_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012380u)

/** Alias (User Manual Name) for DMA_CH28_RDCRCR.
* To use register names with standard convension, please use DMA_CH28_RDCRCR.
*/
#define	DMA_RDCRCR028	(DMA_CH28_RDCRCR)

/** \\brief  2388, DMA Channel Source Address Register */
#define DMA_CH28_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012388u)

/** Alias (User Manual Name) for DMA_CH28_SADR.
* To use register names with standard convension, please use DMA_CH28_SADR.
*/
#define	DMA_SADR028	(DMA_CH28_SADR)

/** \\brief  2384, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH28_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012384u)

/** Alias (User Manual Name) for DMA_CH28_SDCRCR.
* To use register names with standard convension, please use DMA_CH28_SDCRCR.
*/
#define	DMA_SDCRCR028	(DMA_CH28_SDCRCR)

/** \\brief  2398, DMA Channel Shadow Address Register */
#define DMA_CH28_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012398u)

/** Alias (User Manual Name) for DMA_CH28_SHADR.
* To use register names with standard convension, please use DMA_CH28_SHADR.
*/
#define	DMA_SHADR028	(DMA_CH28_SHADR)

/** \\brief  23B0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH29_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00123B0u)

/** Alias (User Manual Name) for DMA_CH29_ADICR.
* To use register names with standard convension, please use DMA_CH29_ADICR.
*/
#define	DMA_ADICR029	(DMA_CH29_ADICR)

/** \\brief  23B4, DMA Channel Configuration Register */
#define DMA_CH29_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00123B4u)

/** Alias (User Manual Name) for DMA_CH29_CHCFGR.
* To use register names with standard convension, please use DMA_CH29_CHCFGR.
*/
#define	DMA_CHCFGR029	(DMA_CH29_CHCFGR)

/** \\brief  23BC, DMARAM Channel Control and Status Register */
#define DMA_CH29_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00123BCu)

/** Alias (User Manual Name) for DMA_CH29_CHCSR.
* To use register names with standard convension, please use DMA_CH29_CHCSR.
*/
#define	DMA_CHCSR029	(DMA_CH29_CHCSR)

