keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  243C, DMARAM Channel Control and Status Register */
#define DMA_CH33_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001243Cu)

/** Alias (User Manual Name) for DMA_CH33_CHCSR.
* To use register names with standard convension, please use DMA_CH33_CHCSR.
*/
#define	DMA_CHCSR033	(DMA_CH33_CHCSR)

/** \\brief  242C, DMA Channel Destination Address Register x */
#define DMA_CH33_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001242Cu)

/** Alias (User Manual Name) for DMA_CH33_DADR.
* To use register names with standard convension, please use DMA_CH33_DADR.
*/
#define	DMA_DADR033	(DMA_CH33_DADR)

/** \\brief  2420, DMA Channel Read Data CRC Register */
#define DMA_CH33_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012420u)

/** Alias (User Manual Name) for DMA_CH33_RDCRCR.
* To use register names with standard convension, please use DMA_CH33_RDCRCR.
*/
#define	DMA_RDCRCR033	(DMA_CH33_RDCRCR)

/** \\brief  2428, DMA Channel Source Address Register */
#define DMA_CH33_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012428u)

/** Alias (User Manual Name) for DMA_CH33_SADR.
* To use register names with standard convension, please use DMA_CH33_SADR.
*/
#define	DMA_SADR033	(DMA_CH33_SADR)

/** \\brief  2424, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH33_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012424u)

/** Alias (User Manual Name) for DMA_CH33_SDCRCR.
* To use register names with standard convension, please use DMA_CH33_SDCRCR.
*/
#define	DMA_SDCRCR033	(DMA_CH33_SDCRCR)

/** \\brief  2438, DMA Channel Shadow Address Register */
#define DMA_CH33_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012438u)

/** Alias (User Manual Name) for DMA_CH33_SHADR.
* To use register names with standard convension, please use DMA_CH33_SHADR.
*/
#define	DMA_SHADR033	(DMA_CH33_SHADR)

/** \\brief  2450, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH34_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012450u)

/** Alias (User Manual Name) for DMA_CH34_ADICR.
* To use register names with standard convension, please use DMA_CH34_ADICR.
*/
#define	DMA_ADICR034	(DMA_CH34_ADICR)

/** \\brief  2454, DMA Channel Configuration Register */
#define DMA_CH34_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012454u)

/** Alias (User Manual Name) for DMA_CH34_CHCFGR.
* To use register names with standard convension, please use DMA_CH34_CHCFGR.
*/
#define	DMA_CHCFGR034	(DMA_CH34_CHCFGR)

/** \\brief  245C, DMARAM Channel Control and Status Register */
#define DMA_CH34_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001245Cu)

/** Alias (User Manual Name) for DMA_CH34_CHCSR.
* To use register names with standard convension, please use DMA_CH34_CHCSR.
*/
#define	DMA_CHCSR034	(DMA_CH34_CHCSR)

/** \\brief  244C, DMA Channel Destination Address Register x */
#define DMA_CH34_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001244Cu)

/** Alias (User Manual Name) for DMA_CH34_DADR.
* To use register names with standard convension, please use DMA_CH34_DADR.
*/
#define	DMA_DADR034	(DMA_CH34_DADR)

/** \\brief  2440, DMA Channel Read Data CRC Register */
#define DMA_CH34_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012440u)

/** Alias (User Manual Name) for DMA_CH34_RDCRCR.
* To use register names with standard convension, please use DMA_CH34_RDCRCR.
*/
#define	DMA_RDCRCR034	(DMA_CH34_RDCRCR)

/** \\brief  2448, DMA Channel Source Address Register */
#define DMA_CH34_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012448u)

/** Alias (User Manual Name) for DMA_CH34_SADR.
* To use register names with standard convension, please use DMA_CH34_SADR.
*/
#define	DMA_SADR034	(DMA_CH34_SADR)

/** \\brief  2444, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH34_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012444u)

/** Alias (User Manual Name) for DMA_CH34_SDCRCR.
* To use register names with standard convension, please use DMA_CH34_SDCRCR.
*/
#define	DMA_SDCRCR034	(DMA_CH34_SDCRCR)

/** \\brief  2458, DMA Channel Shadow Address Register */
#define DMA_CH34_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012458u)

/** Alias (User Manual Name) for DMA_CH34_SHADR.
* To use register names with standard convension, please use DMA_CH34_SHADR.
*/
#define	DMA_SHADR034	(DMA_CH34_SHADR)

/** \\brief  2470, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH35_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012470u)

/** Alias (User Manual Name) for DMA_CH35_ADICR.
* To use register names with standard convension, please use DMA_CH35_ADICR.
*/
#define	DMA_ADICR035	(DMA_CH35_ADICR)

/** \\brief  2474, DMA Channel Configuration Register */
#define DMA_CH35_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012474u)

/** Alias (User Manual Name) for DMA_CH35_CHCFGR.
* To use register names with standard convension, please use DMA_CH35_CHCFGR.
*/
#define	DMA_CHCFGR035	(DMA_CH35_CHCFGR)

/** \\brief  247C, DMARAM Channel Control and Status Register */
#define DMA_CH35_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001247Cu)

/** Alias (User Manual Name) for DMA_CH35_CHCSR.
* To use register names with standard convension, please use DMA_CH35_CHCSR.
*/
#define	DMA_CHCSR035	(DMA_CH35_CHCSR)

/** \\brief  246C, DMA Channel Destination Address Register x */
#define DMA_CH35_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001246Cu)

/** Alias (User Manual Name) for DMA_CH35_DADR.
* To use register names with standard convension, please use DMA_CH35_DADR.
*/
#define	DMA_DADR035	(DMA_CH35_DADR)

/** \\brief  2460, DMA Channel Read Data CRC Register */
#define DMA_CH35_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012460u)

/** Alias (User Manual Name) for DMA_CH35_RDCRCR.
* To use register names with standard convension, please use DMA_CH35_RDCRCR.
*/
#define	DMA_RDCRCR035	(DMA_CH35_RDCRCR)

/** \\brief  2468, DMA Channel Source Address Register */
#define DMA_CH35_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012468u)

