keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH41_SDCRCR.
* To use register names with standard convension, please use DMA_CH41_SDCRCR.
*/
#define	DMA_SDCRCR041	(DMA_CH41_SDCRCR)

/** \\brief  2538, DMA Channel Shadow Address Register */
#define DMA_CH41_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012538u)

/** Alias (User Manual Name) for DMA_CH41_SHADR.
* To use register names with standard convension, please use DMA_CH41_SHADR.
*/
#define	DMA_SHADR041	(DMA_CH41_SHADR)

/** \\brief  2550, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH42_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012550u)

/** Alias (User Manual Name) for DMA_CH42_ADICR.
* To use register names with standard convension, please use DMA_CH42_ADICR.
*/
#define	DMA_ADICR042	(DMA_CH42_ADICR)

/** \\brief  2554, DMA Channel Configuration Register */
#define DMA_CH42_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012554u)

/** Alias (User Manual Name) for DMA_CH42_CHCFGR.
* To use register names with standard convension, please use DMA_CH42_CHCFGR.
*/
#define	DMA_CHCFGR042	(DMA_CH42_CHCFGR)

/** \\brief  255C, DMARAM Channel Control and Status Register */
#define DMA_CH42_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001255Cu)

/** Alias (User Manual Name) for DMA_CH42_CHCSR.
* To use register names with standard convension, please use DMA_CH42_CHCSR.
*/
#define	DMA_CHCSR042	(DMA_CH42_CHCSR)

/** \\brief  254C, DMA Channel Destination Address Register x */
#define DMA_CH42_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001254Cu)

/** Alias (User Manual Name) for DMA_CH42_DADR.
* To use register names with standard convension, please use DMA_CH42_DADR.
*/
#define	DMA_DADR042	(DMA_CH42_DADR)

/** \\brief  2540, DMA Channel Read Data CRC Register */
#define DMA_CH42_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012540u)

/** Alias (User Manual Name) for DMA_CH42_RDCRCR.
* To use register names with standard convension, please use DMA_CH42_RDCRCR.
*/
#define	DMA_RDCRCR042	(DMA_CH42_RDCRCR)

/** \\brief  2548, DMA Channel Source Address Register */
#define DMA_CH42_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012548u)

/** Alias (User Manual Name) for DMA_CH42_SADR.
* To use register names with standard convension, please use DMA_CH42_SADR.
*/
#define	DMA_SADR042	(DMA_CH42_SADR)

/** \\brief  2544, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH42_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012544u)

/** Alias (User Manual Name) for DMA_CH42_SDCRCR.
* To use register names with standard convension, please use DMA_CH42_SDCRCR.
*/
#define	DMA_SDCRCR042	(DMA_CH42_SDCRCR)

/** \\brief  2558, DMA Channel Shadow Address Register */
#define DMA_CH42_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012558u)

/** Alias (User Manual Name) for DMA_CH42_SHADR.
* To use register names with standard convension, please use DMA_CH42_SHADR.
*/
#define	DMA_SHADR042	(DMA_CH42_SHADR)

/** \\brief  2570, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH43_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012570u)

/** Alias (User Manual Name) for DMA_CH43_ADICR.
* To use register names with standard convension, please use DMA_CH43_ADICR.
*/
#define	DMA_ADICR043	(DMA_CH43_ADICR)

/** \\brief  2574, DMA Channel Configuration Register */
#define DMA_CH43_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012574u)

/** Alias (User Manual Name) for DMA_CH43_CHCFGR.
* To use register names with standard convension, please use DMA_CH43_CHCFGR.
*/
#define	DMA_CHCFGR043	(DMA_CH43_CHCFGR)

/** \\brief  257C, DMARAM Channel Control and Status Register */
#define DMA_CH43_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001257Cu)

/** Alias (User Manual Name) for DMA_CH43_CHCSR.
* To use register names with standard convension, please use DMA_CH43_CHCSR.
*/
#define	DMA_CHCSR043	(DMA_CH43_CHCSR)

/** \\brief  256C, DMA Channel Destination Address Register x */
#define DMA_CH43_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001256Cu)

/** Alias (User Manual Name) for DMA_CH43_DADR.
* To use register names with standard convension, please use DMA_CH43_DADR.
*/
#define	DMA_DADR043	(DMA_CH43_DADR)

/** \\brief  2560, DMA Channel Read Data CRC Register */
#define DMA_CH43_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012560u)

/** Alias (User Manual Name) for DMA_CH43_RDCRCR.
* To use register names with standard convension, please use DMA_CH43_RDCRCR.
*/
#define	DMA_RDCRCR043	(DMA_CH43_RDCRCR)

/** \\brief  2568, DMA Channel Source Address Register */
#define DMA_CH43_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012568u)

/** Alias (User Manual Name) for DMA_CH43_SADR.
* To use register names with standard convension, please use DMA_CH43_SADR.
*/
#define	DMA_SADR043	(DMA_CH43_SADR)

/** \\brief  2564, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH43_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012564u)

/** Alias (User Manual Name) for DMA_CH43_SDCRCR.
* To use register names with standard convension, please use DMA_CH43_SDCRCR.
*/
#define	DMA_SDCRCR043	(DMA_CH43_SDCRCR)

/** \\brief  2578, DMA Channel Shadow Address Register */
#define DMA_CH43_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012578u)

/** Alias (User Manual Name) for DMA_CH43_SHADR.
* To use register names with standard convension, please use DMA_CH43_SHADR.
*/
#define	DMA_SHADR043	(DMA_CH43_SHADR)

/** \\brief  2590, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH44_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012590u)

/** Alias (User Manual Name) for DMA_CH44_ADICR.
* To use register names with standard convension, please use DMA_CH44_ADICR.
*/
#define	DMA_ADICR044	(DMA_CH44_ADICR)

