keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  2594, DMA Channel Configuration Register */
#define DMA_CH44_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012594u)

/** Alias (User Manual Name) for DMA_CH44_CHCFGR.
* To use register names with standard convension, please use DMA_CH44_CHCFGR.
*/
#define	DMA_CHCFGR044	(DMA_CH44_CHCFGR)

/** \\brief  259C, DMARAM Channel Control and Status Register */
#define DMA_CH44_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001259Cu)

/** Alias (User Manual Name) for DMA_CH44_CHCSR.
* To use register names with standard convension, please use DMA_CH44_CHCSR.
*/
#define	DMA_CHCSR044	(DMA_CH44_CHCSR)

/** \\brief  258C, DMA Channel Destination Address Register x */
#define DMA_CH44_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001258Cu)

/** Alias (User Manual Name) for DMA_CH44_DADR.
* To use register names with standard convension, please use DMA_CH44_DADR.
*/
#define	DMA_DADR044	(DMA_CH44_DADR)

/** \\brief  2580, DMA Channel Read Data CRC Register */
#define DMA_CH44_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012580u)

/** Alias (User Manual Name) for DMA_CH44_RDCRCR.
* To use register names with standard convension, please use DMA_CH44_RDCRCR.
*/
#define	DMA_RDCRCR044	(DMA_CH44_RDCRCR)

/** \\brief  2588, DMA Channel Source Address Register */
#define DMA_CH44_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012588u)

/** Alias (User Manual Name) for DMA_CH44_SADR.
* To use register names with standard convension, please use DMA_CH44_SADR.
*/
#define	DMA_SADR044	(DMA_CH44_SADR)

/** \\brief  2584, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH44_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012584u)

/** Alias (User Manual Name) for DMA_CH44_SDCRCR.
* To use register names with standard convension, please use DMA_CH44_SDCRCR.
*/
#define	DMA_SDCRCR044	(DMA_CH44_SDCRCR)

/** \\brief  2598, DMA Channel Shadow Address Register */
#define DMA_CH44_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012598u)

/** Alias (User Manual Name) for DMA_CH44_SHADR.
* To use register names with standard convension, please use DMA_CH44_SHADR.
*/
#define	DMA_SHADR044	(DMA_CH44_SHADR)

/** \\brief  25B0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH45_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00125B0u)

/** Alias (User Manual Name) for DMA_CH45_ADICR.
* To use register names with standard convension, please use DMA_CH45_ADICR.
*/
#define	DMA_ADICR045	(DMA_CH45_ADICR)

/** \\brief  25B4, DMA Channel Configuration Register */
#define DMA_CH45_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00125B4u)

/** Alias (User Manual Name) for DMA_CH45_CHCFGR.
* To use register names with standard convension, please use DMA_CH45_CHCFGR.
*/
#define	DMA_CHCFGR045	(DMA_CH45_CHCFGR)

/** \\brief  25BC, DMARAM Channel Control and Status Register */
#define DMA_CH45_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00125BCu)

/** Alias (User Manual Name) for DMA_CH45_CHCSR.
* To use register names with standard convension, please use DMA_CH45_CHCSR.
*/
#define	DMA_CHCSR045	(DMA_CH45_CHCSR)

/** \\brief  25AC, DMA Channel Destination Address Register x */
#define DMA_CH45_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00125ACu)

/** Alias (User Manual Name) for DMA_CH45_DADR.
* To use register names with standard convension, please use DMA_CH45_DADR.
*/
#define	DMA_DADR045	(DMA_CH45_DADR)

/** \\brief  25A0, DMA Channel Read Data CRC Register */
#define DMA_CH45_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00125A0u)

/** Alias (User Manual Name) for DMA_CH45_RDCRCR.
* To use register names with standard convension, please use DMA_CH45_RDCRCR.
*/
#define	DMA_RDCRCR045	(DMA_CH45_RDCRCR)

/** \\brief  25A8, DMA Channel Source Address Register */
#define DMA_CH45_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00125A8u)

/** Alias (User Manual Name) for DMA_CH45_SADR.
* To use register names with standard convension, please use DMA_CH45_SADR.
*/
#define	DMA_SADR045	(DMA_CH45_SADR)

/** \\brief  25A4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH45_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00125A4u)

/** Alias (User Manual Name) for DMA_CH45_SDCRCR.
* To use register names with standard convension, please use DMA_CH45_SDCRCR.
*/
#define	DMA_SDCRCR045	(DMA_CH45_SDCRCR)

/** \\brief  25B8, DMA Channel Shadow Address Register */
#define DMA_CH45_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00125B8u)

/** Alias (User Manual Name) for DMA_CH45_SHADR.
* To use register names with standard convension, please use DMA_CH45_SHADR.
*/
#define	DMA_SHADR045	(DMA_CH45_SHADR)

/** \\brief  25D0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH46_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00125D0u)

/** Alias (User Manual Name) for DMA_CH46_ADICR.
* To use register names with standard convension, please use DMA_CH46_ADICR.
*/
#define	DMA_ADICR046	(DMA_CH46_ADICR)

/** \\brief  25D4, DMA Channel Configuration Register */
#define DMA_CH46_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00125D4u)

/** Alias (User Manual Name) for DMA_CH46_CHCFGR.
* To use register names with standard convension, please use DMA_CH46_CHCFGR.
*/
#define	DMA_CHCFGR046	(DMA_CH46_CHCFGR)

/** \\brief  25DC, DMARAM Channel Control and Status Register */
#define DMA_CH46_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00125DCu)

/** Alias (User Manual Name) for DMA_CH46_CHCSR.
* To use register names with standard convension, please use DMA_CH46_CHCSR.
*/
#define	DMA_CHCSR046	(DMA_CH46_CHCSR)

/** \\brief  25CC, DMA Channel Destination Address Register x */
#define DMA_CH46_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00125CCu)

/** Alias (User Manual Name) for DMA_CH46_DADR.
* To use register names with standard convension, please use DMA_CH46_DADR.
*/
#define	DMA_DADR046	(DMA_CH46_DADR)

/** \\brief  25C0, DMA Channel Read Data CRC Register */
#define DMA_CH46_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00125C0u)

/** Alias (User Manual Name) for DMA_CH46_RDCRCR.
* To use register names with standard convension, please use DMA_CH46_RDCRCR.
*/
#define	DMA_RDCRCR046	(DMA_CH46_RDCRCR)

/** \\brief  25C8, DMA Channel Source Address Register */
#define DMA_CH46_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00125C8u)

