keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH46_SADR.
* To use register names with standard convension, please use DMA_CH46_SADR.
*/
#define	DMA_SADR046	(DMA_CH46_SADR)

/** \\brief  25C4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH46_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00125C4u)

/** Alias (User Manual Name) for DMA_CH46_SDCRCR.
* To use register names with standard convension, please use DMA_CH46_SDCRCR.
*/
#define	DMA_SDCRCR046	(DMA_CH46_SDCRCR)

/** \\brief  25D8, DMA Channel Shadow Address Register */
#define DMA_CH46_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00125D8u)

/** Alias (User Manual Name) for DMA_CH46_SHADR.
* To use register names with standard convension, please use DMA_CH46_SHADR.
*/
#define	DMA_SHADR046	(DMA_CH46_SHADR)

/** \\brief  25F0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH47_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00125F0u)

/** Alias (User Manual Name) for DMA_CH47_ADICR.
* To use register names with standard convension, please use DMA_CH47_ADICR.
*/
#define	DMA_ADICR047	(DMA_CH47_ADICR)

/** \\brief  25F4, DMA Channel Configuration Register */
#define DMA_CH47_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00125F4u)

/** Alias (User Manual Name) for DMA_CH47_CHCFGR.
* To use register names with standard convension, please use DMA_CH47_CHCFGR.
*/
#define	DMA_CHCFGR047	(DMA_CH47_CHCFGR)

/** \\brief  25FC, DMARAM Channel Control and Status Register */
#define DMA_CH47_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00125FCu)

/** Alias (User Manual Name) for DMA_CH47_CHCSR.
* To use register names with standard convension, please use DMA_CH47_CHCSR.
*/
#define	DMA_CHCSR047	(DMA_CH47_CHCSR)

/** \\brief  25EC, DMA Channel Destination Address Register x */
#define DMA_CH47_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00125ECu)

/** Alias (User Manual Name) for DMA_CH47_DADR.
* To use register names with standard convension, please use DMA_CH47_DADR.
*/
#define	DMA_DADR047	(DMA_CH47_DADR)

/** \\brief  25E0, DMA Channel Read Data CRC Register */
#define DMA_CH47_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00125E0u)

/** Alias (User Manual Name) for DMA_CH47_RDCRCR.
* To use register names with standard convension, please use DMA_CH47_RDCRCR.
*/
#define	DMA_RDCRCR047	(DMA_CH47_RDCRCR)

/** \\brief  25E8, DMA Channel Source Address Register */
#define DMA_CH47_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00125E8u)

/** Alias (User Manual Name) for DMA_CH47_SADR.
* To use register names with standard convension, please use DMA_CH47_SADR.
*/
#define	DMA_SADR047	(DMA_CH47_SADR)

/** \\brief  25E4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH47_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00125E4u)

/** Alias (User Manual Name) for DMA_CH47_SDCRCR.
* To use register names with standard convension, please use DMA_CH47_SDCRCR.
*/
#define	DMA_SDCRCR047	(DMA_CH47_SDCRCR)

/** \\brief  25F8, DMA Channel Shadow Address Register */
#define DMA_CH47_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00125F8u)

/** Alias (User Manual Name) for DMA_CH47_SHADR.
* To use register names with standard convension, please use DMA_CH47_SHADR.
*/
#define	DMA_SHADR047	(DMA_CH47_SHADR)

/** \\brief  2610, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH48_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012610u)

/** Alias (User Manual Name) for DMA_CH48_ADICR.
* To use register names with standard convension, please use DMA_CH48_ADICR.
*/
#define	DMA_ADICR048	(DMA_CH48_ADICR)

/** \\brief  2614, DMA Channel Configuration Register */
#define DMA_CH48_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012614u)

/** Alias (User Manual Name) for DMA_CH48_CHCFGR.
* To use register names with standard convension, please use DMA_CH48_CHCFGR.
*/
#define	DMA_CHCFGR048	(DMA_CH48_CHCFGR)

/** \\brief  261C, DMARAM Channel Control and Status Register */
#define DMA_CH48_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001261Cu)

/** Alias (User Manual Name) for DMA_CH48_CHCSR.
* To use register names with standard convension, please use DMA_CH48_CHCSR.
*/
#define	DMA_CHCSR048	(DMA_CH48_CHCSR)

/** \\brief  260C, DMA Channel Destination Address Register x */
#define DMA_CH48_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001260Cu)

/** Alias (User Manual Name) for DMA_CH48_DADR.
* To use register names with standard convension, please use DMA_CH48_DADR.
*/
#define	DMA_DADR048	(DMA_CH48_DADR)

/** \\brief  2600, DMA Channel Read Data CRC Register */
#define DMA_CH48_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012600u)

/** Alias (User Manual Name) for DMA_CH48_RDCRCR.
* To use register names with standard convension, please use DMA_CH48_RDCRCR.
*/
#define	DMA_RDCRCR048	(DMA_CH48_RDCRCR)

/** \\brief  2608, DMA Channel Source Address Register */
#define DMA_CH48_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012608u)

/** Alias (User Manual Name) for DMA_CH48_SADR.
* To use register names with standard convension, please use DMA_CH48_SADR.
*/
#define	DMA_SADR048	(DMA_CH48_SADR)

/** \\brief  2604, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH48_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012604u)

/** Alias (User Manual Name) for DMA_CH48_SDCRCR.
* To use register names with standard convension, please use DMA_CH48_SDCRCR.
*/
#define	DMA_SDCRCR048	(DMA_CH48_SDCRCR)

/** \\brief  2618, DMA Channel Shadow Address Register */
#define DMA_CH48_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012618u)

/** Alias (User Manual Name) for DMA_CH48_SHADR.
* To use register names with standard convension, please use DMA_CH48_SHADR.
*/
#define	DMA_SHADR048	(DMA_CH48_SHADR)

/** \\brief  2630, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH49_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012630u)

