keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  2640, DMA Channel Read Data CRC Register */
#define DMA_CH50_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012640u)

/** Alias (User Manual Name) for DMA_CH50_RDCRCR.
* To use register names with standard convension, please use DMA_CH50_RDCRCR.
*/
#define	DMA_RDCRCR050	(DMA_CH50_RDCRCR)

/** \\brief  2648, DMA Channel Source Address Register */
#define DMA_CH50_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012648u)

/** Alias (User Manual Name) for DMA_CH50_SADR.
* To use register names with standard convension, please use DMA_CH50_SADR.
*/
#define	DMA_SADR050	(DMA_CH50_SADR)

/** \\brief  2644, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH50_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012644u)

/** Alias (User Manual Name) for DMA_CH50_SDCRCR.
* To use register names with standard convension, please use DMA_CH50_SDCRCR.
*/
#define	DMA_SDCRCR050	(DMA_CH50_SDCRCR)

/** \\brief  2658, DMA Channel Shadow Address Register */
#define DMA_CH50_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012658u)

/** Alias (User Manual Name) for DMA_CH50_SHADR.
* To use register names with standard convension, please use DMA_CH50_SHADR.
*/
#define	DMA_SHADR050	(DMA_CH50_SHADR)

/** \\brief  2670, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH51_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012670u)

/** Alias (User Manual Name) for DMA_CH51_ADICR.
* To use register names with standard convension, please use DMA_CH51_ADICR.
*/
#define	DMA_ADICR051	(DMA_CH51_ADICR)

/** \\brief  2674, DMA Channel Configuration Register */
#define DMA_CH51_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012674u)

/** Alias (User Manual Name) for DMA_CH51_CHCFGR.
* To use register names with standard convension, please use DMA_CH51_CHCFGR.
*/
#define	DMA_CHCFGR051	(DMA_CH51_CHCFGR)

/** \\brief  267C, DMARAM Channel Control and Status Register */
#define DMA_CH51_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001267Cu)

/** Alias (User Manual Name) for DMA_CH51_CHCSR.
* To use register names with standard convension, please use DMA_CH51_CHCSR.
*/
#define	DMA_CHCSR051	(DMA_CH51_CHCSR)

/** \\brief  266C, DMA Channel Destination Address Register x */
#define DMA_CH51_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001266Cu)

/** Alias (User Manual Name) for DMA_CH51_DADR.
* To use register names with standard convension, please use DMA_CH51_DADR.
*/
#define	DMA_DADR051	(DMA_CH51_DADR)

/** \\brief  2660, DMA Channel Read Data CRC Register */
#define DMA_CH51_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012660u)

/** Alias (User Manual Name) for DMA_CH51_RDCRCR.
* To use register names with standard convension, please use DMA_CH51_RDCRCR.
*/
#define	DMA_RDCRCR051	(DMA_CH51_RDCRCR)

/** \\brief  2668, DMA Channel Source Address Register */
#define DMA_CH51_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012668u)

/** Alias (User Manual Name) for DMA_CH51_SADR.
* To use register names with standard convension, please use DMA_CH51_SADR.
*/
#define	DMA_SADR051	(DMA_CH51_SADR)

/** \\brief  2664, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH51_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012664u)

/** Alias (User Manual Name) for DMA_CH51_SDCRCR.
* To use register names with standard convension, please use DMA_CH51_SDCRCR.
*/
#define	DMA_SDCRCR051	(DMA_CH51_SDCRCR)

/** \\brief  2678, DMA Channel Shadow Address Register */
#define DMA_CH51_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012678u)

/** Alias (User Manual Name) for DMA_CH51_SHADR.
* To use register names with standard convension, please use DMA_CH51_SHADR.
*/
#define	DMA_SHADR051	(DMA_CH51_SHADR)

/** \\brief  2690, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH52_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012690u)

/** Alias (User Manual Name) for DMA_CH52_ADICR.
* To use register names with standard convension, please use DMA_CH52_ADICR.
*/
#define	DMA_ADICR052	(DMA_CH52_ADICR)

/** \\brief  2694, DMA Channel Configuration Register */
#define DMA_CH52_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012694u)

/** Alias (User Manual Name) for DMA_CH52_CHCFGR.
* To use register names with standard convension, please use DMA_CH52_CHCFGR.
*/
#define	DMA_CHCFGR052	(DMA_CH52_CHCFGR)

/** \\brief  269C, DMARAM Channel Control and Status Register */
#define DMA_CH52_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001269Cu)

/** Alias (User Manual Name) for DMA_CH52_CHCSR.
* To use register names with standard convension, please use DMA_CH52_CHCSR.
*/
#define	DMA_CHCSR052	(DMA_CH52_CHCSR)

/** \\brief  268C, DMA Channel Destination Address Register x */
#define DMA_CH52_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001268Cu)

/** Alias (User Manual Name) for DMA_CH52_DADR.
* To use register names with standard convension, please use DMA_CH52_DADR.
*/
#define	DMA_DADR052	(DMA_CH52_DADR)

/** \\brief  2680, DMA Channel Read Data CRC Register */
#define DMA_CH52_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012680u)

/** Alias (User Manual Name) for DMA_CH52_RDCRCR.
* To use register names with standard convension, please use DMA_CH52_RDCRCR.
*/
#define	DMA_RDCRCR052	(DMA_CH52_RDCRCR)

/** \\brief  2688, DMA Channel Source Address Register */
#define DMA_CH52_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012688u)

/** Alias (User Manual Name) for DMA_CH52_SADR.
* To use register names with standard convension, please use DMA_CH52_SADR.
*/
#define	DMA_SADR052	(DMA_CH52_SADR)

/** \\brief  2684, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH52_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012684u)

/** Alias (User Manual Name) for DMA_CH52_SDCRCR.
* To use register names with standard convension, please use DMA_CH52_SDCRCR.
*/
#define	DMA_SDCRCR052	(DMA_CH52_SDCRCR)

/** \\brief  2698, DMA Channel Shadow Address Register */
#define DMA_CH52_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012698u)

/** Alias (User Manual Name) for DMA_CH52_SHADR.
* To use register names with standard convension, please use DMA_CH52_SHADR.
*/
#define	DMA_SHADR052	(DMA_CH52_SHADR)

