keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  26B0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH53_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00126B0u)

/** Alias (User Manual Name) for DMA_CH53_ADICR.
* To use register names with standard convension, please use DMA_CH53_ADICR.
*/
#define	DMA_ADICR053	(DMA_CH53_ADICR)

/** \\brief  26B4, DMA Channel Configuration Register */
#define DMA_CH53_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00126B4u)

/** Alias (User Manual Name) for DMA_CH53_CHCFGR.
* To use register names with standard convension, please use DMA_CH53_CHCFGR.
*/
#define	DMA_CHCFGR053	(DMA_CH53_CHCFGR)

/** \\brief  26BC, DMARAM Channel Control and Status Register */
#define DMA_CH53_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00126BCu)

/** Alias (User Manual Name) for DMA_CH53_CHCSR.
* To use register names with standard convension, please use DMA_CH53_CHCSR.
*/
#define	DMA_CHCSR053	(DMA_CH53_CHCSR)

/** \\brief  26AC, DMA Channel Destination Address Register x */
#define DMA_CH53_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00126ACu)

/** Alias (User Manual Name) for DMA_CH53_DADR.
* To use register names with standard convension, please use DMA_CH53_DADR.
*/
#define	DMA_DADR053	(DMA_CH53_DADR)

/** \\brief  26A0, DMA Channel Read Data CRC Register */
#define DMA_CH53_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00126A0u)

/** Alias (User Manual Name) for DMA_CH53_RDCRCR.
* To use register names with standard convension, please use DMA_CH53_RDCRCR.
*/
#define	DMA_RDCRCR053	(DMA_CH53_RDCRCR)

/** \\brief  26A8, DMA Channel Source Address Register */
#define DMA_CH53_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00126A8u)

/** Alias (User Manual Name) for DMA_CH53_SADR.
* To use register names with standard convension, please use DMA_CH53_SADR.
*/
#define	DMA_SADR053	(DMA_CH53_SADR)

/** \\brief  26A4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH53_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00126A4u)

/** Alias (User Manual Name) for DMA_CH53_SDCRCR.
* To use register names with standard convension, please use DMA_CH53_SDCRCR.
*/
#define	DMA_SDCRCR053	(DMA_CH53_SDCRCR)

/** \\brief  26B8, DMA Channel Shadow Address Register */
#define DMA_CH53_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00126B8u)

/** Alias (User Manual Name) for DMA_CH53_SHADR.
* To use register names with standard convension, please use DMA_CH53_SHADR.
*/
#define	DMA_SHADR053	(DMA_CH53_SHADR)

/** \\brief  26D0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH54_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00126D0u)

/** Alias (User Manual Name) for DMA_CH54_ADICR.
* To use register names with standard convension, please use DMA_CH54_ADICR.
*/
#define	DMA_ADICR054	(DMA_CH54_ADICR)

/** \\brief  26D4, DMA Channel Configuration Register */
#define DMA_CH54_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00126D4u)

/** Alias (User Manual Name) for DMA_CH54_CHCFGR.
* To use register names with standard convension, please use DMA_CH54_CHCFGR.
*/
#define	DMA_CHCFGR054	(DMA_CH54_CHCFGR)

/** \\brief  26DC, DMARAM Channel Control and Status Register */
#define DMA_CH54_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00126DCu)

/** Alias (User Manual Name) for DMA_CH54_CHCSR.
* To use register names with standard convension, please use DMA_CH54_CHCSR.
*/
#define	DMA_CHCSR054	(DMA_CH54_CHCSR)

/** \\brief  26CC, DMA Channel Destination Address Register x */
#define DMA_CH54_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00126CCu)

/** Alias (User Manual Name) for DMA_CH54_DADR.
* To use register names with standard convension, please use DMA_CH54_DADR.
*/
#define	DMA_DADR054	(DMA_CH54_DADR)

/** \\brief  26C0, DMA Channel Read Data CRC Register */
#define DMA_CH54_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00126C0u)

/** Alias (User Manual Name) for DMA_CH54_RDCRCR.
* To use register names with standard convension, please use DMA_CH54_RDCRCR.
*/
#define	DMA_RDCRCR054	(DMA_CH54_RDCRCR)

/** \\brief  26C8, DMA Channel Source Address Register */
#define DMA_CH54_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00126C8u)

/** Alias (User Manual Name) for DMA_CH54_SADR.
* To use register names with standard convension, please use DMA_CH54_SADR.
*/
#define	DMA_SADR054	(DMA_CH54_SADR)

/** \\brief  26C4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH54_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00126C4u)

/** Alias (User Manual Name) for DMA_CH54_SDCRCR.
* To use register names with standard convension, please use DMA_CH54_SDCRCR.
*/
#define	DMA_SDCRCR054	(DMA_CH54_SDCRCR)

/** \\brief  26D8, DMA Channel Shadow Address Register */
#define DMA_CH54_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00126D8u)

/** Alias (User Manual Name) for DMA_CH54_SHADR.
* To use register names with standard convension, please use DMA_CH54_SHADR.
*/
#define	DMA_SHADR054	(DMA_CH54_SHADR)

/** \\brief  26F0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH55_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00126F0u)

/** Alias (User Manual Name) for DMA_CH55_ADICR.
* To use register names with standard convension, please use DMA_CH55_ADICR.
*/
#define	DMA_ADICR055	(DMA_CH55_ADICR)

/** \\brief  26F4, DMA Channel Configuration Register */
#define DMA_CH55_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00126F4u)

/** Alias (User Manual Name) for DMA_CH55_CHCFGR.
* To use register names with standard convension, please use DMA_CH55_CHCFGR.
*/
#define	DMA_CHCFGR055	(DMA_CH55_CHCFGR)

/** \\brief  26FC, DMARAM Channel Control and Status Register */
#define DMA_CH55_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00126FCu)

/** Alias (User Manual Name) for DMA_CH55_CHCSR.
* To use register names with standard convension, please use DMA_CH55_CHCSR.
*/
#define	DMA_CHCSR055	(DMA_CH55_CHCSR)

/** \\brief  26EC, DMA Channel Destination Address Register x */
#define DMA_CH55_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00126ECu)

/** Alias (User Manual Name) for DMA_CH55_DADR.
* To use register names with standard convension, please use DMA_CH55_DADR.
*/
#define	DMA_DADR055	(DMA_CH55_DADR)

