keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  26E0, DMA Channel Read Data CRC Register */
#define DMA_CH55_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00126E0u)

/** Alias (User Manual Name) for DMA_CH55_RDCRCR.
* To use register names with standard convension, please use DMA_CH55_RDCRCR.
*/
#define	DMA_RDCRCR055	(DMA_CH55_RDCRCR)

/** \\brief  26E8, DMA Channel Source Address Register */
#define DMA_CH55_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00126E8u)

/** Alias (User Manual Name) for DMA_CH55_SADR.
* To use register names with standard convension, please use DMA_CH55_SADR.
*/
#define	DMA_SADR055	(DMA_CH55_SADR)

/** \\brief  26E4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH55_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00126E4u)

/** Alias (User Manual Name) for DMA_CH55_SDCRCR.
* To use register names with standard convension, please use DMA_CH55_SDCRCR.
*/
#define	DMA_SDCRCR055	(DMA_CH55_SDCRCR)

/** \\brief  26F8, DMA Channel Shadow Address Register */
#define DMA_CH55_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00126F8u)

/** Alias (User Manual Name) for DMA_CH55_SHADR.
* To use register names with standard convension, please use DMA_CH55_SHADR.
*/
#define	DMA_SHADR055	(DMA_CH55_SHADR)

/** \\brief  2710, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH56_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012710u)

/** Alias (User Manual Name) for DMA_CH56_ADICR.
* To use register names with standard convension, please use DMA_CH56_ADICR.
*/
#define	DMA_ADICR056	(DMA_CH56_ADICR)

/** \\brief  2714, DMA Channel Configuration Register */
#define DMA_CH56_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012714u)

/** Alias (User Manual Name) for DMA_CH56_CHCFGR.
* To use register names with standard convension, please use DMA_CH56_CHCFGR.
*/
#define	DMA_CHCFGR056	(DMA_CH56_CHCFGR)

/** \\brief  271C, DMARAM Channel Control and Status Register */
#define DMA_CH56_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001271Cu)

/** Alias (User Manual Name) for DMA_CH56_CHCSR.
* To use register names with standard convension, please use DMA_CH56_CHCSR.
*/
#define	DMA_CHCSR056	(DMA_CH56_CHCSR)

/** \\brief  270C, DMA Channel Destination Address Register x */
#define DMA_CH56_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001270Cu)

/** Alias (User Manual Name) for DMA_CH56_DADR.
* To use register names with standard convension, please use DMA_CH56_DADR.
*/
#define	DMA_DADR056	(DMA_CH56_DADR)

/** \\brief  2700, DMA Channel Read Data CRC Register */
#define DMA_CH56_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012700u)

/** Alias (User Manual Name) for DMA_CH56_RDCRCR.
* To use register names with standard convension, please use DMA_CH56_RDCRCR.
*/
#define	DMA_RDCRCR056	(DMA_CH56_RDCRCR)

/** \\brief  2708, DMA Channel Source Address Register */
#define DMA_CH56_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012708u)

/** Alias (User Manual Name) for DMA_CH56_SADR.
* To use register names with standard convension, please use DMA_CH56_SADR.
*/
#define	DMA_SADR056	(DMA_CH56_SADR)

/** \\brief  2704, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH56_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012704u)

/** Alias (User Manual Name) for DMA_CH56_SDCRCR.
* To use register names with standard convension, please use DMA_CH56_SDCRCR.
*/
#define	DMA_SDCRCR056	(DMA_CH56_SDCRCR)

/** \\brief  2718, DMA Channel Shadow Address Register */
#define DMA_CH56_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012718u)

/** Alias (User Manual Name) for DMA_CH56_SHADR.
* To use register names with standard convension, please use DMA_CH56_SHADR.
*/
#define	DMA_SHADR056	(DMA_CH56_SHADR)

/** \\brief  2730, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH57_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012730u)

/** Alias (User Manual Name) for DMA_CH57_ADICR.
* To use register names with standard convension, please use DMA_CH57_ADICR.
*/
#define	DMA_ADICR057	(DMA_CH57_ADICR)

/** \\brief  2734, DMA Channel Configuration Register */
#define DMA_CH57_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012734u)

/** Alias (User Manual Name) for DMA_CH57_CHCFGR.
* To use register names with standard convension, please use DMA_CH57_CHCFGR.
*/
#define	DMA_CHCFGR057	(DMA_CH57_CHCFGR)

/** \\brief  273C, DMARAM Channel Control and Status Register */
#define DMA_CH57_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001273Cu)

/** Alias (User Manual Name) for DMA_CH57_CHCSR.
* To use register names with standard convension, please use DMA_CH57_CHCSR.
*/
#define	DMA_CHCSR057	(DMA_CH57_CHCSR)

/** \\brief  272C, DMA Channel Destination Address Register x */
#define DMA_CH57_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001272Cu)

/** Alias (User Manual Name) for DMA_CH57_DADR.
* To use register names with standard convension, please use DMA_CH57_DADR.
*/
#define	DMA_DADR057	(DMA_CH57_DADR)

/** \\brief  2720, DMA Channel Read Data CRC Register */
#define DMA_CH57_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012720u)

/** Alias (User Manual Name) for DMA_CH57_RDCRCR.
* To use register names with standard convension, please use DMA_CH57_RDCRCR.
*/
#define	DMA_RDCRCR057	(DMA_CH57_RDCRCR)

/** \\brief  2728, DMA Channel Source Address Register */
#define DMA_CH57_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012728u)

/** Alias (User Manual Name) for DMA_CH57_SADR.
* To use register names with standard convension, please use DMA_CH57_SADR.
*/
#define	DMA_SADR057	(DMA_CH57_SADR)

/** \\brief  2724, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH57_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012724u)

