keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH57_SDCRCR.
* To use register names with standard convension, please use DMA_CH57_SDCRCR.
*/
#define	DMA_SDCRCR057	(DMA_CH57_SDCRCR)

/** \\brief  2738, DMA Channel Shadow Address Register */
#define DMA_CH57_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012738u)

/** Alias (User Manual Name) for DMA_CH57_SHADR.
* To use register names with standard convension, please use DMA_CH57_SHADR.
*/
#define	DMA_SHADR057	(DMA_CH57_SHADR)

/** \\brief  2750, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH58_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012750u)

/** Alias (User Manual Name) for DMA_CH58_ADICR.
* To use register names with standard convension, please use DMA_CH58_ADICR.
*/
#define	DMA_ADICR058	(DMA_CH58_ADICR)

/** \\brief  2754, DMA Channel Configuration Register */
#define DMA_CH58_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012754u)

/** Alias (User Manual Name) for DMA_CH58_CHCFGR.
* To use register names with standard convension, please use DMA_CH58_CHCFGR.
*/
#define	DMA_CHCFGR058	(DMA_CH58_CHCFGR)

/** \\brief  275C, DMARAM Channel Control and Status Register */
#define DMA_CH58_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001275Cu)

/** Alias (User Manual Name) for DMA_CH58_CHCSR.
* To use register names with standard convension, please use DMA_CH58_CHCSR.
*/
#define	DMA_CHCSR058	(DMA_CH58_CHCSR)

/** \\brief  274C, DMA Channel Destination Address Register x */
#define DMA_CH58_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001274Cu)

/** Alias (User Manual Name) for DMA_CH58_DADR.
* To use register names with standard convension, please use DMA_CH58_DADR.
*/
#define	DMA_DADR058	(DMA_CH58_DADR)

/** \\brief  2740, DMA Channel Read Data CRC Register */
#define DMA_CH58_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012740u)

/** Alias (User Manual Name) for DMA_CH58_RDCRCR.
* To use register names with standard convension, please use DMA_CH58_RDCRCR.
*/
#define	DMA_RDCRCR058	(DMA_CH58_RDCRCR)

/** \\brief  2748, DMA Channel Source Address Register */
#define DMA_CH58_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012748u)

/** Alias (User Manual Name) for DMA_CH58_SADR.
* To use register names with standard convension, please use DMA_CH58_SADR.
*/
#define	DMA_SADR058	(DMA_CH58_SADR)

/** \\brief  2744, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH58_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012744u)

/** Alias (User Manual Name) for DMA_CH58_SDCRCR.
* To use register names with standard convension, please use DMA_CH58_SDCRCR.
*/
#define	DMA_SDCRCR058	(DMA_CH58_SDCRCR)

/** \\brief  2758, DMA Channel Shadow Address Register */
#define DMA_CH58_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012758u)

/** Alias (User Manual Name) for DMA_CH58_SHADR.
* To use register names with standard convension, please use DMA_CH58_SHADR.
*/
#define	DMA_SHADR058	(DMA_CH58_SHADR)

/** \\brief  2770, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH59_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012770u)

/** Alias (User Manual Name) for DMA_CH59_ADICR.
* To use register names with standard convension, please use DMA_CH59_ADICR.
*/
#define	DMA_ADICR059	(DMA_CH59_ADICR)

/** \\brief  2774, DMA Channel Configuration Register */
#define DMA_CH59_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012774u)

/** Alias (User Manual Name) for DMA_CH59_CHCFGR.
* To use register names with standard convension, please use DMA_CH59_CHCFGR.
*/
#define	DMA_CHCFGR059	(DMA_CH59_CHCFGR)

/** \\brief  277C, DMARAM Channel Control and Status Register */
#define DMA_CH59_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001277Cu)

/** Alias (User Manual Name) for DMA_CH59_CHCSR.
* To use register names with standard convension, please use DMA_CH59_CHCSR.
*/
#define	DMA_CHCSR059	(DMA_CH59_CHCSR)

/** \\brief  276C, DMA Channel Destination Address Register x */
#define DMA_CH59_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001276Cu)

/** Alias (User Manual Name) for DMA_CH59_DADR.
* To use register names with standard convension, please use DMA_CH59_DADR.
*/
#define	DMA_DADR059	(DMA_CH59_DADR)

/** \\brief  2760, DMA Channel Read Data CRC Register */
#define DMA_CH59_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012760u)

/** Alias (User Manual Name) for DMA_CH59_RDCRCR.
* To use register names with standard convension, please use DMA_CH59_RDCRCR.
*/
#define	DMA_RDCRCR059	(DMA_CH59_RDCRCR)

/** \\brief  2768, DMA Channel Source Address Register */
#define DMA_CH59_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012768u)

/** Alias (User Manual Name) for DMA_CH59_SADR.
* To use register names with standard convension, please use DMA_CH59_SADR.
*/
#define	DMA_SADR059	(DMA_CH59_SADR)

/** \\brief  2764, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH59_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012764u)

/** Alias (User Manual Name) for DMA_CH59_SDCRCR.
* To use register names with standard convension, please use DMA_CH59_SDCRCR.
*/
#define	DMA_SDCRCR059	(DMA_CH59_SDCRCR)

/** \\brief  2778, DMA Channel Shadow Address Register */
#define DMA_CH59_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012778u)

/** Alias (User Manual Name) for DMA_CH59_SHADR.
* To use register names with standard convension, please use DMA_CH59_SHADR.
*/
#define	DMA_SHADR059	(DMA_CH59_SHADR)

/** \\brief  20B0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH5_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00120B0u)

/** Alias (User Manual Name) for DMA_CH5_ADICR.
* To use register names with standard convension, please use DMA_CH5_ADICR.
*/
#define	DMA_ADICR005	(DMA_CH5_ADICR)

/** \\brief  20B4, DMA Channel Configuration Register */
#define DMA_CH5_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00120B4u)

/** Alias (User Manual Name) for DMA_CH5_CHCFGR.
* To use register names with standard convension, please use DMA_CH5_CHCFGR.
*/
#define	DMA_CHCFGR005	(DMA_CH5_CHCFGR)

/** \\brief  20BC, DMARAM Channel Control and Status Register */
#define DMA_CH5_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00120BCu)

/** Alias (User Manual Name) for DMA_CH5_CHCSR.
* To use register names with standard convension, please use DMA_CH5_CHCSR.
*/
#define	DMA_CHCSR005	(DMA_CH5_CHCSR)

/** \\brief  20AC, DMA Channel Destination Address Register x */
#define DMA_CH5_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00120ACu)

