keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH64_SADR.
* To use register names with standard convension, please use DMA_CH64_SADR.
*/
#define	DMA_SADR064	(DMA_CH64_SADR)

/** \\brief  2804, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH64_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012804u)

/** Alias (User Manual Name) for DMA_CH64_SDCRCR.
* To use register names with standard convension, please use DMA_CH64_SDCRCR.
*/
#define	DMA_SDCRCR064	(DMA_CH64_SDCRCR)

/** \\brief  2818, DMA Channel Shadow Address Register */
#define DMA_CH64_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012818u)

/** Alias (User Manual Name) for DMA_CH64_SHADR.
* To use register names with standard convension, please use DMA_CH64_SHADR.
*/
#define	DMA_SHADR064	(DMA_CH64_SHADR)

/** \\brief  2830, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH65_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012830u)

/** Alias (User Manual Name) for DMA_CH65_ADICR.
* To use register names with standard convension, please use DMA_CH65_ADICR.
*/
#define	DMA_ADICR065	(DMA_CH65_ADICR)

/** \\brief  2834, DMA Channel Configuration Register */
#define DMA_CH65_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012834u)

/** Alias (User Manual Name) for DMA_CH65_CHCFGR.
* To use register names with standard convension, please use DMA_CH65_CHCFGR.
*/
#define	DMA_CHCFGR065	(DMA_CH65_CHCFGR)

/** \\brief  283C, DMARAM Channel Control and Status Register */
#define DMA_CH65_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001283Cu)

/** Alias (User Manual Name) for DMA_CH65_CHCSR.
* To use register names with standard convension, please use DMA_CH65_CHCSR.
*/
#define	DMA_CHCSR065	(DMA_CH65_CHCSR)

/** \\brief  282C, DMA Channel Destination Address Register x */
#define DMA_CH65_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001282Cu)

/** Alias (User Manual Name) for DMA_CH65_DADR.
* To use register names with standard convension, please use DMA_CH65_DADR.
*/
#define	DMA_DADR065	(DMA_CH65_DADR)

/** \\brief  2820, DMA Channel Read Data CRC Register */
#define DMA_CH65_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012820u)

/** Alias (User Manual Name) for DMA_CH65_RDCRCR.
* To use register names with standard convension, please use DMA_CH65_RDCRCR.
*/
#define	DMA_RDCRCR065	(DMA_CH65_RDCRCR)

/** \\brief  2828, DMA Channel Source Address Register */
#define DMA_CH65_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012828u)

/** Alias (User Manual Name) for DMA_CH65_SADR.
* To use register names with standard convension, please use DMA_CH65_SADR.
*/
#define	DMA_SADR065	(DMA_CH65_SADR)

/** \\brief  2824, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH65_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012824u)

/** Alias (User Manual Name) for DMA_CH65_SDCRCR.
* To use register names with standard convension, please use DMA_CH65_SDCRCR.
*/
#define	DMA_SDCRCR065	(DMA_CH65_SDCRCR)

/** \\brief  2838, DMA Channel Shadow Address Register */
#define DMA_CH65_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012838u)

/** Alias (User Manual Name) for DMA_CH65_SHADR.
* To use register names with standard convension, please use DMA_CH65_SHADR.
*/
#define	DMA_SHADR065	(DMA_CH65_SHADR)

/** \\brief  2850, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH66_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012850u)

/** Alias (User Manual Name) for DMA_CH66_ADICR.
* To use register names with standard convension, please use DMA_CH66_ADICR.
*/
#define	DMA_ADICR066	(DMA_CH66_ADICR)

/** \\brief  2854, DMA Channel Configuration Register */
#define DMA_CH66_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012854u)

/** Alias (User Manual Name) for DMA_CH66_CHCFGR.
* To use register names with standard convension, please use DMA_CH66_CHCFGR.
*/
#define	DMA_CHCFGR066	(DMA_CH66_CHCFGR)

/** \\brief  285C, DMARAM Channel Control and Status Register */
#define DMA_CH66_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001285Cu)

/** Alias (User Manual Name) for DMA_CH66_CHCSR.
* To use register names with standard convension, please use DMA_CH66_CHCSR.
*/
#define	DMA_CHCSR066	(DMA_CH66_CHCSR)

/** \\brief  284C, DMA Channel Destination Address Register x */
#define DMA_CH66_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001284Cu)

/** Alias (User Manual Name) for DMA_CH66_DADR.
* To use register names with standard convension, please use DMA_CH66_DADR.
*/
#define	DMA_DADR066	(DMA_CH66_DADR)

/** \\brief  2840, DMA Channel Read Data CRC Register */
#define DMA_CH66_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012840u)

/** Alias (User Manual Name) for DMA_CH66_RDCRCR.
* To use register names with standard convension, please use DMA_CH66_RDCRCR.
*/
#define	DMA_RDCRCR066	(DMA_CH66_RDCRCR)

/** \\brief  2848, DMA Channel Source Address Register */
#define DMA_CH66_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012848u)

/** Alias (User Manual Name) for DMA_CH66_SADR.
* To use register names with standard convension, please use DMA_CH66_SADR.
*/
#define	DMA_SADR066	(DMA_CH66_SADR)

/** \\brief  2844, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH66_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012844u)

/** Alias (User Manual Name) for DMA_CH66_SDCRCR.
* To use register names with standard convension, please use DMA_CH66_SDCRCR.
*/
#define	DMA_SDCRCR066	(DMA_CH66_SDCRCR)

/** \\brief  2858, DMA Channel Shadow Address Register */
#define DMA_CH66_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012858u)

/** Alias (User Manual Name) for DMA_CH66_SHADR.
* To use register names with standard convension, please use DMA_CH66_SHADR.
*/
#define	DMA_SHADR066	(DMA_CH66_SHADR)

/** \\brief  2870, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH67_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012870u)

