keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH67_ADICR.
* To use register names with standard convension, please use DMA_CH67_ADICR.
*/
#define	DMA_ADICR067	(DMA_CH67_ADICR)

/** \\brief  2874, DMA Channel Configuration Register */
#define DMA_CH67_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012874u)

/** Alias (User Manual Name) for DMA_CH67_CHCFGR.
* To use register names with standard convension, please use DMA_CH67_CHCFGR.
*/
#define	DMA_CHCFGR067	(DMA_CH67_CHCFGR)

/** \\brief  287C, DMARAM Channel Control and Status Register */
#define DMA_CH67_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001287Cu)

/** Alias (User Manual Name) for DMA_CH67_CHCSR.
* To use register names with standard convension, please use DMA_CH67_CHCSR.
*/
#define	DMA_CHCSR067	(DMA_CH67_CHCSR)

/** \\brief  286C, DMA Channel Destination Address Register x */
#define DMA_CH67_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001286Cu)

/** Alias (User Manual Name) for DMA_CH67_DADR.
* To use register names with standard convension, please use DMA_CH67_DADR.
*/
#define	DMA_DADR067	(DMA_CH67_DADR)

/** \\brief  2860, DMA Channel Read Data CRC Register */
#define DMA_CH67_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012860u)

/** Alias (User Manual Name) for DMA_CH67_RDCRCR.
* To use register names with standard convension, please use DMA_CH67_RDCRCR.
*/
#define	DMA_RDCRCR067	(DMA_CH67_RDCRCR)

/** \\brief  2868, DMA Channel Source Address Register */
#define DMA_CH67_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012868u)

/** Alias (User Manual Name) for DMA_CH67_SADR.
* To use register names with standard convension, please use DMA_CH67_SADR.
*/
#define	DMA_SADR067	(DMA_CH67_SADR)

/** \\brief  2864, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH67_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012864u)

/** Alias (User Manual Name) for DMA_CH67_SDCRCR.
* To use register names with standard convension, please use DMA_CH67_SDCRCR.
*/
#define	DMA_SDCRCR067	(DMA_CH67_SDCRCR)

/** \\brief  2878, DMA Channel Shadow Address Register */
#define DMA_CH67_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012878u)

/** Alias (User Manual Name) for DMA_CH67_SHADR.
* To use register names with standard convension, please use DMA_CH67_SHADR.
*/
#define	DMA_SHADR067	(DMA_CH67_SHADR)

/** \\brief  2890, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH68_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012890u)

/** Alias (User Manual Name) for DMA_CH68_ADICR.
* To use register names with standard convension, please use DMA_CH68_ADICR.
*/
#define	DMA_ADICR068	(DMA_CH68_ADICR)

/** \\brief  2894, DMA Channel Configuration Register */
#define DMA_CH68_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012894u)

/** Alias (User Manual Name) for DMA_CH68_CHCFGR.
* To use register names with standard convension, please use DMA_CH68_CHCFGR.
*/
#define	DMA_CHCFGR068	(DMA_CH68_CHCFGR)

/** \\brief  289C, DMARAM Channel Control and Status Register */
#define DMA_CH68_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001289Cu)

/** Alias (User Manual Name) for DMA_CH68_CHCSR.
* To use register names with standard convension, please use DMA_CH68_CHCSR.
*/
#define	DMA_CHCSR068	(DMA_CH68_CHCSR)

/** \\brief  288C, DMA Channel Destination Address Register x */
#define DMA_CH68_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001288Cu)

/** Alias (User Manual Name) for DMA_CH68_DADR.
* To use register names with standard convension, please use DMA_CH68_DADR.
*/
#define	DMA_DADR068	(DMA_CH68_DADR)

/** \\brief  2880, DMA Channel Read Data CRC Register */
#define DMA_CH68_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012880u)

/** Alias (User Manual Name) for DMA_CH68_RDCRCR.
* To use register names with standard convension, please use DMA_CH68_RDCRCR.
*/
#define	DMA_RDCRCR068	(DMA_CH68_RDCRCR)

/** \\brief  2888, DMA Channel Source Address Register */
#define DMA_CH68_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012888u)

/** Alias (User Manual Name) for DMA_CH68_SADR.
* To use register names with standard convension, please use DMA_CH68_SADR.
*/
#define	DMA_SADR068	(DMA_CH68_SADR)

/** \\brief  2884, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH68_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012884u)

/** Alias (User Manual Name) for DMA_CH68_SDCRCR.
* To use register names with standard convension, please use DMA_CH68_SDCRCR.
*/
#define	DMA_SDCRCR068	(DMA_CH68_SDCRCR)

/** \\brief  2898, DMA Channel Shadow Address Register */
#define DMA_CH68_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012898u)

/** Alias (User Manual Name) for DMA_CH68_SHADR.
* To use register names with standard convension, please use DMA_CH68_SHADR.
*/
#define	DMA_SHADR068	(DMA_CH68_SHADR)

/** \\brief  28B0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH69_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00128B0u)

/** Alias (User Manual Name) for DMA_CH69_ADICR.
* To use register names with standard convension, please use DMA_CH69_ADICR.
*/
#define	DMA_ADICR069	(DMA_CH69_ADICR)

/** \\brief  28B4, DMA Channel Configuration Register */
#define DMA_CH69_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00128B4u)

/** Alias (User Manual Name) for DMA_CH69_CHCFGR.
* To use register names with standard convension, please use DMA_CH69_CHCFGR.
*/
#define	DMA_CHCFGR069	(DMA_CH69_CHCFGR)

/** \\brief  28BC, DMARAM Channel Control and Status Register */
#define DMA_CH69_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00128BCu)

/** Alias (User Manual Name) for DMA_CH69_CHCSR.
* To use register names with standard convension, please use DMA_CH69_CHCSR.
*/
#define	DMA_CHCSR069	(DMA_CH69_CHCSR)

