keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  28AC, DMA Channel Destination Address Register x */
#define DMA_CH69_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00128ACu)

/** Alias (User Manual Name) for DMA_CH69_DADR.
* To use register names with standard convension, please use DMA_CH69_DADR.
*/
#define	DMA_DADR069	(DMA_CH69_DADR)

/** \\brief  28A0, DMA Channel Read Data CRC Register */
#define DMA_CH69_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00128A0u)

/** Alias (User Manual Name) for DMA_CH69_RDCRCR.
* To use register names with standard convension, please use DMA_CH69_RDCRCR.
*/
#define	DMA_RDCRCR069	(DMA_CH69_RDCRCR)

/** \\brief  28A8, DMA Channel Source Address Register */
#define DMA_CH69_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00128A8u)

/** Alias (User Manual Name) for DMA_CH69_SADR.
* To use register names with standard convension, please use DMA_CH69_SADR.
*/
#define	DMA_SADR069	(DMA_CH69_SADR)

/** \\brief  28A4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH69_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00128A4u)

/** Alias (User Manual Name) for DMA_CH69_SDCRCR.
* To use register names with standard convension, please use DMA_CH69_SDCRCR.
*/
#define	DMA_SDCRCR069	(DMA_CH69_SDCRCR)

/** \\brief  28B8, DMA Channel Shadow Address Register */
#define DMA_CH69_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00128B8u)

/** Alias (User Manual Name) for DMA_CH69_SHADR.
* To use register names with standard convension, please use DMA_CH69_SHADR.
*/
#define	DMA_SHADR069	(DMA_CH69_SHADR)

/** \\brief  20D0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH6_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00120D0u)

/** Alias (User Manual Name) for DMA_CH6_ADICR.
* To use register names with standard convension, please use DMA_CH6_ADICR.
*/
#define	DMA_ADICR006	(DMA_CH6_ADICR)

/** \\brief  20D4, DMA Channel Configuration Register */
#define DMA_CH6_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00120D4u)

/** Alias (User Manual Name) for DMA_CH6_CHCFGR.
* To use register names with standard convension, please use DMA_CH6_CHCFGR.
*/
#define	DMA_CHCFGR006	(DMA_CH6_CHCFGR)

/** \\brief  20DC, DMARAM Channel Control and Status Register */
#define DMA_CH6_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00120DCu)

/** Alias (User Manual Name) for DMA_CH6_CHCSR.
* To use register names with standard convension, please use DMA_CH6_CHCSR.
*/
#define	DMA_CHCSR006	(DMA_CH6_CHCSR)

/** \\brief  20CC, DMA Channel Destination Address Register x */
#define DMA_CH6_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00120CCu)

/** Alias (User Manual Name) for DMA_CH6_DADR.
* To use register names with standard convension, please use DMA_CH6_DADR.
*/
#define	DMA_DADR006	(DMA_CH6_DADR)

/** \\brief  20C0, DMA Channel Read Data CRC Register */
#define DMA_CH6_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00120C0u)

/** Alias (User Manual Name) for DMA_CH6_RDCRCR.
* To use register names with standard convension, please use DMA_CH6_RDCRCR.
*/
#define	DMA_RDCRCR006	(DMA_CH6_RDCRCR)

/** \\brief  20C8, DMA Channel Source Address Register */
#define DMA_CH6_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00120C8u)

/** Alias (User Manual Name) for DMA_CH6_SADR.
* To use register names with standard convension, please use DMA_CH6_SADR.
*/
#define	DMA_SADR006	(DMA_CH6_SADR)

/** \\brief  20C4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH6_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00120C4u)

/** Alias (User Manual Name) for DMA_CH6_SDCRCR.
* To use register names with standard convension, please use DMA_CH6_SDCRCR.
*/
#define	DMA_SDCRCR006	(DMA_CH6_SDCRCR)

/** \\brief  20D8, DMA Channel Shadow Address Register */
#define DMA_CH6_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00120D8u)

/** Alias (User Manual Name) for DMA_CH6_SHADR.
* To use register names with standard convension, please use DMA_CH6_SHADR.
*/
#define	DMA_SHADR006	(DMA_CH6_SHADR)

/** \\brief  28D0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH70_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00128D0u)

/** Alias (User Manual Name) for DMA_CH70_ADICR.
* To use register names with standard convension, please use DMA_CH70_ADICR.
*/
#define	DMA_ADICR070	(DMA_CH70_ADICR)

/** \\brief  28D4, DMA Channel Configuration Register */
#define DMA_CH70_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00128D4u)

/** Alias (User Manual Name) for DMA_CH70_CHCFGR.
* To use register names with standard convension, please use DMA_CH70_CHCFGR.
*/
#define	DMA_CHCFGR070	(DMA_CH70_CHCFGR)

/** \\brief  28DC, DMARAM Channel Control and Status Register */
#define DMA_CH70_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00128DCu)

/** Alias (User Manual Name) for DMA_CH70_CHCSR.
* To use register names with standard convension, please use DMA_CH70_CHCSR.
*/
#define	DMA_CHCSR070	(DMA_CH70_CHCSR)

/** \\brief  28CC, DMA Channel Destination Address Register x */
#define DMA_CH70_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00128CCu)

/** Alias (User Manual Name) for DMA_CH70_DADR.
* To use register names with standard convension, please use DMA_CH70_DADR.
*/
#define	DMA_DADR070	(DMA_CH70_DADR)

/** \\brief  28C0, DMA Channel Read Data CRC Register */
#define DMA_CH70_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00128C0u)

/** Alias (User Manual Name) for DMA_CH70_RDCRCR.
* To use register names with standard convension, please use DMA_CH70_RDCRCR.
*/
#define	DMA_RDCRCR070	(DMA_CH70_RDCRCR)

/** \\brief  28C8, DMA Channel Source Address Register */
#define DMA_CH70_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00128C8u)

/** Alias (User Manual Name) for DMA_CH70_SADR.
* To use register names with standard convension, please use DMA_CH70_SADR.
*/
#define	DMA_SADR070	(DMA_CH70_SADR)

/** \\brief  28C4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH70_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00128C4u)

