keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH77_SHADR.
* To use register names with standard convension, please use DMA_CH77_SHADR.
*/
#define	DMA_SHADR077	(DMA_CH77_SHADR)

/** \\brief  29D0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH78_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00129D0u)

/** Alias (User Manual Name) for DMA_CH78_ADICR.
* To use register names with standard convension, please use DMA_CH78_ADICR.
*/
#define	DMA_ADICR078	(DMA_CH78_ADICR)

/** \\brief  29D4, DMA Channel Configuration Register */
#define DMA_CH78_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00129D4u)

/** Alias (User Manual Name) for DMA_CH78_CHCFGR.
* To use register names with standard convension, please use DMA_CH78_CHCFGR.
*/
#define	DMA_CHCFGR078	(DMA_CH78_CHCFGR)

/** \\brief  29DC, DMARAM Channel Control and Status Register */
#define DMA_CH78_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00129DCu)

/** Alias (User Manual Name) for DMA_CH78_CHCSR.
* To use register names with standard convension, please use DMA_CH78_CHCSR.
*/
#define	DMA_CHCSR078	(DMA_CH78_CHCSR)

/** \\brief  29CC, DMA Channel Destination Address Register x */
#define DMA_CH78_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00129CCu)

/** Alias (User Manual Name) for DMA_CH78_DADR.
* To use register names with standard convension, please use DMA_CH78_DADR.
*/
#define	DMA_DADR078	(DMA_CH78_DADR)

/** \\brief  29C0, DMA Channel Read Data CRC Register */
#define DMA_CH78_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00129C0u)

/** Alias (User Manual Name) for DMA_CH78_RDCRCR.
* To use register names with standard convension, please use DMA_CH78_RDCRCR.
*/
#define	DMA_RDCRCR078	(DMA_CH78_RDCRCR)

/** \\brief  29C8, DMA Channel Source Address Register */
#define DMA_CH78_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00129C8u)

/** Alias (User Manual Name) for DMA_CH78_SADR.
* To use register names with standard convension, please use DMA_CH78_SADR.
*/
#define	DMA_SADR078	(DMA_CH78_SADR)

/** \\brief  29C4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH78_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00129C4u)

/** Alias (User Manual Name) for DMA_CH78_SDCRCR.
* To use register names with standard convension, please use DMA_CH78_SDCRCR.
*/
#define	DMA_SDCRCR078	(DMA_CH78_SDCRCR)

/** \\brief  29D8, DMA Channel Shadow Address Register */
#define DMA_CH78_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00129D8u)

/** Alias (User Manual Name) for DMA_CH78_SHADR.
* To use register names with standard convension, please use DMA_CH78_SHADR.
*/
#define	DMA_SHADR078	(DMA_CH78_SHADR)

/** \\brief  29F0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH79_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00129F0u)

/** Alias (User Manual Name) for DMA_CH79_ADICR.
* To use register names with standard convension, please use DMA_CH79_ADICR.
*/
#define	DMA_ADICR079	(DMA_CH79_ADICR)

/** \\brief  29F4, DMA Channel Configuration Register */
#define DMA_CH79_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00129F4u)

/** Alias (User Manual Name) for DMA_CH79_CHCFGR.
* To use register names with standard convension, please use DMA_CH79_CHCFGR.
*/
#define	DMA_CHCFGR079	(DMA_CH79_CHCFGR)

/** \\brief  29FC, DMARAM Channel Control and Status Register */
#define DMA_CH79_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00129FCu)

/** Alias (User Manual Name) for DMA_CH79_CHCSR.
* To use register names with standard convension, please use DMA_CH79_CHCSR.
*/
#define	DMA_CHCSR079	(DMA_CH79_CHCSR)

/** \\brief  29EC, DMA Channel Destination Address Register x */
#define DMA_CH79_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00129ECu)

/** Alias (User Manual Name) for DMA_CH79_DADR.
* To use register names with standard convension, please use DMA_CH79_DADR.
*/
#define	DMA_DADR079	(DMA_CH79_DADR)

/** \\brief  29E0, DMA Channel Read Data CRC Register */
#define DMA_CH79_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00129E0u)

/** Alias (User Manual Name) for DMA_CH79_RDCRCR.
* To use register names with standard convension, please use DMA_CH79_RDCRCR.
*/
#define	DMA_RDCRCR079	(DMA_CH79_RDCRCR)

/** \\brief  29E8, DMA Channel Source Address Register */
#define DMA_CH79_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00129E8u)

/** Alias (User Manual Name) for DMA_CH79_SADR.
* To use register names with standard convension, please use DMA_CH79_SADR.
*/
#define	DMA_SADR079	(DMA_CH79_SADR)

/** \\brief  29E4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH79_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00129E4u)

/** Alias (User Manual Name) for DMA_CH79_SDCRCR.
* To use register names with standard convension, please use DMA_CH79_SDCRCR.
*/
#define	DMA_SDCRCR079	(DMA_CH79_SDCRCR)

/** \\brief  29F8, DMA Channel Shadow Address Register */
#define DMA_CH79_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00129F8u)

/** Alias (User Manual Name) for DMA_CH79_SHADR.
* To use register names with standard convension, please use DMA_CH79_SHADR.
*/
#define	DMA_SHADR079	(DMA_CH79_SHADR)

/** \\brief  20F0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH7_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00120F0u)

/** Alias (User Manual Name) for DMA_CH7_ADICR.
* To use register names with standard convension, please use DMA_CH7_ADICR.
*/
#define	DMA_ADICR007	(DMA_CH7_ADICR)

/** \\brief  20F4, DMA Channel Configuration Register */
#define DMA_CH7_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00120F4u)

/** Alias (User Manual Name) for DMA_CH7_CHCFGR.
* To use register names with standard convension, please use DMA_CH7_CHCFGR.
*/
#define	DMA_CHCFGR007	(DMA_CH7_CHCFGR)

/** \\brief  20FC, DMARAM Channel Control and Status Register */
#define DMA_CH7_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00120FCu)

