keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  2B70, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH91_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B70u)

/** Alias (User Manual Name) for DMA_CH91_ADICR.
* To use register names with standard convension, please use DMA_CH91_ADICR.
*/
#define	DMA_ADICR091	(DMA_CH91_ADICR)

/** \\brief  2B74, DMA Channel Configuration Register */
#define DMA_CH91_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B74u)

/** Alias (User Manual Name) for DMA_CH91_CHCFGR.
* To use register names with standard convension, please use DMA_CH91_CHCFGR.
*/
#define	DMA_CHCFGR091	(DMA_CH91_CHCFGR)

/** \\brief  2B7C, DMARAM Channel Control and Status Register */
#define DMA_CH91_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B7Cu)

/** Alias (User Manual Name) for DMA_CH91_CHCSR.
* To use register names with standard convension, please use DMA_CH91_CHCSR.
*/
#define	DMA_CHCSR091	(DMA_CH91_CHCSR)

/** \\brief  2B6C, DMA Channel Destination Address Register x */
#define DMA_CH91_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B6Cu)

/** Alias (User Manual Name) for DMA_CH91_DADR.
* To use register names with standard convension, please use DMA_CH91_DADR.
*/
#define	DMA_DADR091	(DMA_CH91_DADR)

/** \\brief  2B60, DMA Channel Read Data CRC Register */
#define DMA_CH91_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B60u)

/** Alias (User Manual Name) for DMA_CH91_RDCRCR.
* To use register names with standard convension, please use DMA_CH91_RDCRCR.
*/
#define	DMA_RDCRCR091	(DMA_CH91_RDCRCR)

/** \\brief  2B68, DMA Channel Source Address Register */
#define DMA_CH91_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B68u)

/** Alias (User Manual Name) for DMA_CH91_SADR.
* To use register names with standard convension, please use DMA_CH91_SADR.
*/
#define	DMA_SADR091	(DMA_CH91_SADR)

/** \\brief  2B64, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH91_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B64u)

/** Alias (User Manual Name) for DMA_CH91_SDCRCR.
* To use register names with standard convension, please use DMA_CH91_SDCRCR.
*/
#define	DMA_SDCRCR091	(DMA_CH91_SDCRCR)

/** \\brief  2B78, DMA Channel Shadow Address Register */
#define DMA_CH91_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B78u)

/** Alias (User Manual Name) for DMA_CH91_SHADR.
* To use register names with standard convension, please use DMA_CH91_SHADR.
*/
#define	DMA_SHADR091	(DMA_CH91_SHADR)

/** \\brief  2B90, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH92_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012B90u)

/** Alias (User Manual Name) for DMA_CH92_ADICR.
* To use register names with standard convension, please use DMA_CH92_ADICR.
*/
#define	DMA_ADICR092	(DMA_CH92_ADICR)

/** \\brief  2B94, DMA Channel Configuration Register */
#define DMA_CH92_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012B94u)

/** Alias (User Manual Name) for DMA_CH92_CHCFGR.
* To use register names with standard convension, please use DMA_CH92_CHCFGR.
*/
#define	DMA_CHCFGR092	(DMA_CH92_CHCFGR)

/** \\brief  2B9C, DMARAM Channel Control and Status Register */
#define DMA_CH92_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012B9Cu)

/** Alias (User Manual Name) for DMA_CH92_CHCSR.
* To use register names with standard convension, please use DMA_CH92_CHCSR.
*/
#define	DMA_CHCSR092	(DMA_CH92_CHCSR)

/** \\brief  2B8C, DMA Channel Destination Address Register x */
#define DMA_CH92_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012B8Cu)

/** Alias (User Manual Name) for DMA_CH92_DADR.
* To use register names with standard convension, please use DMA_CH92_DADR.
*/
#define	DMA_DADR092	(DMA_CH92_DADR)

/** \\brief  2B80, DMA Channel Read Data CRC Register */
#define DMA_CH92_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012B80u)

/** Alias (User Manual Name) for DMA_CH92_RDCRCR.
* To use register names with standard convension, please use DMA_CH92_RDCRCR.
*/
#define	DMA_RDCRCR092	(DMA_CH92_RDCRCR)

/** \\brief  2B88, DMA Channel Source Address Register */
#define DMA_CH92_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012B88u)

/** Alias (User Manual Name) for DMA_CH92_SADR.
* To use register names with standard convension, please use DMA_CH92_SADR.
*/
#define	DMA_SADR092	(DMA_CH92_SADR)

/** \\brief  2B84, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH92_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012B84u)

/** Alias (User Manual Name) for DMA_CH92_SDCRCR.
* To use register names with standard convension, please use DMA_CH92_SDCRCR.
*/
#define	DMA_SDCRCR092	(DMA_CH92_SDCRCR)

/** \\brief  2B98, DMA Channel Shadow Address Register */
#define DMA_CH92_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012B98u)

/** Alias (User Manual Name) for DMA_CH92_SHADR.
* To use register names with standard convension, please use DMA_CH92_SHADR.
*/
#define	DMA_SHADR092	(DMA_CH92_SHADR)

/** \\brief  2BB0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH93_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012BB0u)

/** Alias (User Manual Name) for DMA_CH93_ADICR.
* To use register names with standard convension, please use DMA_CH93_ADICR.
*/
#define	DMA_ADICR093	(DMA_CH93_ADICR)

/** \\brief  2BB4, DMA Channel Configuration Register */
#define DMA_CH93_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012BB4u)

/** Alias (User Manual Name) for DMA_CH93_CHCFGR.
* To use register names with standard convension, please use DMA_CH93_CHCFGR.
*/
#define	DMA_CHCFGR093	(DMA_CH93_CHCFGR)

/** \\brief  2BBC, DMARAM Channel Control and Status Register */
#define DMA_CH93_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012BBCu)

/** Alias (User Manual Name) for DMA_CH93_CHCSR.
* To use register names with standard convension, please use DMA_CH93_CHCSR.
*/
#define	DMA_CHCSR093	(DMA_CH93_CHCSR)

/** \\brief  2BAC, DMA Channel Destination Address Register x */
#define DMA_CH93_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012BACu)

