keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_CH98_SADR.
* To use register names with standard convension, please use DMA_CH98_SADR.
*/
#define	DMA_SADR098	(DMA_CH98_SADR)

/** \\brief  2C44, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH98_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012C44u)

/** Alias (User Manual Name) for DMA_CH98_SDCRCR.
* To use register names with standard convension, please use DMA_CH98_SDCRCR.
*/
#define	DMA_SDCRCR098	(DMA_CH98_SDCRCR)

/** \\brief  2C58, DMA Channel Shadow Address Register */
#define DMA_CH98_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012C58u)

/** Alias (User Manual Name) for DMA_CH98_SHADR.
* To use register names with standard convension, please use DMA_CH98_SHADR.
*/
#define	DMA_SHADR098	(DMA_CH98_SHADR)

/** \\brief  2C70, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH99_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012C70u)

/** Alias (User Manual Name) for DMA_CH99_ADICR.
* To use register names with standard convension, please use DMA_CH99_ADICR.
*/
#define	DMA_ADICR099	(DMA_CH99_ADICR)

/** \\brief  2C74, DMA Channel Configuration Register */
#define DMA_CH99_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012C74u)

/** Alias (User Manual Name) for DMA_CH99_CHCFGR.
* To use register names with standard convension, please use DMA_CH99_CHCFGR.
*/
#define	DMA_CHCFGR099	(DMA_CH99_CHCFGR)

/** \\brief  2C7C, DMARAM Channel Control and Status Register */
#define DMA_CH99_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012C7Cu)

/** Alias (User Manual Name) for DMA_CH99_CHCSR.
* To use register names with standard convension, please use DMA_CH99_CHCSR.
*/
#define	DMA_CHCSR099	(DMA_CH99_CHCSR)

/** \\brief  2C6C, DMA Channel Destination Address Register x */
#define DMA_CH99_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012C6Cu)

/** Alias (User Manual Name) for DMA_CH99_DADR.
* To use register names with standard convension, please use DMA_CH99_DADR.
*/
#define	DMA_DADR099	(DMA_CH99_DADR)

/** \\brief  2C60, DMA Channel Read Data CRC Register */
#define DMA_CH99_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012C60u)

/** Alias (User Manual Name) for DMA_CH99_RDCRCR.
* To use register names with standard convension, please use DMA_CH99_RDCRCR.
*/
#define	DMA_RDCRCR099	(DMA_CH99_RDCRCR)

/** \\brief  2C68, DMA Channel Source Address Register */
#define DMA_CH99_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012C68u)

/** Alias (User Manual Name) for DMA_CH99_SADR.
* To use register names with standard convension, please use DMA_CH99_SADR.
*/
#define	DMA_SADR099	(DMA_CH99_SADR)

/** \\brief  2C64, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH99_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012C64u)

/** Alias (User Manual Name) for DMA_CH99_SDCRCR.
* To use register names with standard convension, please use DMA_CH99_SDCRCR.
*/
#define	DMA_SDCRCR099	(DMA_CH99_SDCRCR)

/** \\brief  2C78, DMA Channel Shadow Address Register */
#define DMA_CH99_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012C78u)

/** Alias (User Manual Name) for DMA_CH99_SHADR.
* To use register names with standard convension, please use DMA_CH99_SHADR.
*/
#define	DMA_SHADR099	(DMA_CH99_SHADR)

/** \\brief  2130, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH9_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012130u)

/** Alias (User Manual Name) for DMA_CH9_ADICR.
* To use register names with standard convension, please use DMA_CH9_ADICR.
*/
#define	DMA_ADICR009	(DMA_CH9_ADICR)

/** \\brief  2134, DMA Channel Configuration Register */
#define DMA_CH9_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012134u)

/** Alias (User Manual Name) for DMA_CH9_CHCFGR.
* To use register names with standard convension, please use DMA_CH9_CHCFGR.
*/
#define	DMA_CHCFGR009	(DMA_CH9_CHCFGR)

/** \\brief  213C, DMARAM Channel Control and Status Register */
#define DMA_CH9_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001213Cu)

/** Alias (User Manual Name) for DMA_CH9_CHCSR.
* To use register names with standard convension, please use DMA_CH9_CHCSR.
*/
#define	DMA_CHCSR009	(DMA_CH9_CHCSR)

/** \\brief  212C, DMA Channel Destination Address Register x */
#define DMA_CH9_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001212Cu)

/** Alias (User Manual Name) for DMA_CH9_DADR.
* To use register names with standard convension, please use DMA_CH9_DADR.
*/
#define	DMA_DADR009	(DMA_CH9_DADR)

/** \\brief  2120, DMA Channel Read Data CRC Register */
#define DMA_CH9_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012120u)

/** Alias (User Manual Name) for DMA_CH9_RDCRCR.
* To use register names with standard convension, please use DMA_CH9_RDCRCR.
*/
#define	DMA_RDCRCR009	(DMA_CH9_RDCRCR)

/** \\brief  2128, DMA Channel Source Address Register */
#define DMA_CH9_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012128u)

/** Alias (User Manual Name) for DMA_CH9_SADR.
* To use register names with standard convension, please use DMA_CH9_SADR.
*/
#define	DMA_SADR009	(DMA_CH9_SADR)

/** \\brief  2124, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH9_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012124u)

/** Alias (User Manual Name) for DMA_CH9_SDCRCR.
* To use register names with standard convension, please use DMA_CH9_SDCRCR.
*/
#define	DMA_SDCRCR009	(DMA_CH9_SDCRCR)

/** \\brief  2138, DMA Channel Shadow Address Register */
#define DMA_CH9_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012138u)

/** Alias (User Manual Name) for DMA_CH9_SHADR.
* To use register names with standard convension, please use DMA_CH9_SHADR.
*/
#define	DMA_SHADR009	(DMA_CH9_SHADR)

/** \\brief  0, DMA Clock Control Register */
#define DMA_CLC /*lint --e(923)*/ (*(volatile Ifx_DMA_CLC*)0xF0010000u)

/** \\brief  1204, DMA Error Interrupt Set Register */
#define DMA_ERRINTR /*lint --e(923)*/ (*(volatile Ifx_DMA_ERRINTR*)0xF0011204u)

/** \\brief  1800, DMA Channel Hardware Resource Register */
#define DMA_HRR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011800u)

/** Alias (User Manual Name) for DMA_HRR0.
* To use register names with standard convension, please use DMA_HRR0.
*/
#define	DMA_HRR000	(DMA_HRR0)

/** \\brief  1804, DMA Channel Hardware Resource Register */
#define DMA_HRR1 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011804u)

/** Alias (User Manual Name) for DMA_HRR1.
* To use register names with standard convension, please use DMA_HRR1.
*/
#define	DMA_HRR001	(DMA_HRR1)

/** \\brief  1828, DMA Channel Hardware Resource Register */
#define DMA_HRR10 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011828u)

/** Alias (User Manual Name) for DMA_HRR10.
* To use register names with standard convension, please use DMA_HRR10.
*/
#define	DMA_HRR010	(DMA_HRR10)

/** \\brief  1990, DMA Channel Hardware Resource Register */
#define DMA_HRR100 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011990u)

/** \\brief  1994, DMA Channel Hardware Resource Register */
#define DMA_HRR101 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011994u)

