keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_HRR39.
* To use register names with standard convension, please use DMA_HRR39.
*/
#define	DMA_HRR039	(DMA_HRR39)

/** \\brief  1810, DMA Channel Hardware Resource Register */
#define DMA_HRR4 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011810u)

/** Alias (User Manual Name) for DMA_HRR4.
* To use register names with standard convension, please use DMA_HRR4.
*/
#define	DMA_HRR004	(DMA_HRR4)

/** \\brief  18A0, DMA Channel Hardware Resource Register */
#define DMA_HRR40 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118A0u)

/** Alias (User Manual Name) for DMA_HRR40.
* To use register names with standard convension, please use DMA_HRR40.
*/
#define	DMA_HRR040	(DMA_HRR40)

/** \\brief  18A4, DMA Channel Hardware Resource Register */
#define DMA_HRR41 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118A4u)

/** Alias (User Manual Name) for DMA_HRR41.
* To use register names with standard convension, please use DMA_HRR41.
*/
#define	DMA_HRR041	(DMA_HRR41)

/** \\brief  18A8, DMA Channel Hardware Resource Register */
#define DMA_HRR42 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118A8u)

/** Alias (User Manual Name) for DMA_HRR42.
* To use register names with standard convension, please use DMA_HRR42.
*/
#define	DMA_HRR042	(DMA_HRR42)

/** \\brief  18AC, DMA Channel Hardware Resource Register */
#define DMA_HRR43 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118ACu)

/** Alias (User Manual Name) for DMA_HRR43.
* To use register names with standard convension, please use DMA_HRR43.
*/
#define	DMA_HRR043	(DMA_HRR43)

/** \\brief  18B0, DMA Channel Hardware Resource Register */
#define DMA_HRR44 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118B0u)

/** Alias (User Manual Name) for DMA_HRR44.
* To use register names with standard convension, please use DMA_HRR44.
*/
#define	DMA_HRR044	(DMA_HRR44)

/** \\brief  18B4, DMA Channel Hardware Resource Register */
#define DMA_HRR45 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118B4u)

/** Alias (User Manual Name) for DMA_HRR45.
* To use register names with standard convension, please use DMA_HRR45.
*/
#define	DMA_HRR045	(DMA_HRR45)

/** \\brief  18B8, DMA Channel Hardware Resource Register */
#define DMA_HRR46 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118B8u)

/** Alias (User Manual Name) for DMA_HRR46.
* To use register names with standard convension, please use DMA_HRR46.
*/
#define	DMA_HRR046	(DMA_HRR46)

/** \\brief  18BC, DMA Channel Hardware Resource Register */
#define DMA_HRR47 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118BCu)

/** Alias (User Manual Name) for DMA_HRR47.
* To use register names with standard convension, please use DMA_HRR47.
*/
#define	DMA_HRR047	(DMA_HRR47)

/** \\brief  18C0, DMA Channel Hardware Resource Register */
#define DMA_HRR48 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118C0u)

/** Alias (User Manual Name) for DMA_HRR48.
* To use register names with standard convension, please use DMA_HRR48.
*/
#define	DMA_HRR048	(DMA_HRR48)

/** \\brief  18C4, DMA Channel Hardware Resource Register */
#define DMA_HRR49 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118C4u)

/** Alias (User Manual Name) for DMA_HRR49.
* To use register names with standard convension, please use DMA_HRR49.
*/
#define	DMA_HRR049	(DMA_HRR49)

/** \\brief  1814, DMA Channel Hardware Resource Register */
#define DMA_HRR5 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011814u)

/** Alias (User Manual Name) for DMA_HRR5.
* To use register names with standard convension, please use DMA_HRR5.
*/
#define	DMA_HRR005	(DMA_HRR5)

/** \\brief  18C8, DMA Channel Hardware Resource Register */
#define DMA_HRR50 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118C8u)

/** Alias (User Manual Name) for DMA_HRR50.
* To use register names with standard convension, please use DMA_HRR50.
*/
#define	DMA_HRR050	(DMA_HRR50)

/** \\brief  18CC, DMA Channel Hardware Resource Register */
#define DMA_HRR51 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118CCu)

/** Alias (User Manual Name) for DMA_HRR51.
* To use register names with standard convension, please use DMA_HRR51.
*/
#define	DMA_HRR051	(DMA_HRR51)

/** \\brief  18D0, DMA Channel Hardware Resource Register */
#define DMA_HRR52 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118D0u)

/** Alias (User Manual Name) for DMA_HRR52.
* To use register names with standard convension, please use DMA_HRR52.
*/
#define	DMA_HRR052	(DMA_HRR52)

/** \\brief  18D4, DMA Channel Hardware Resource Register */
#define DMA_HRR53 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118D4u)

/** Alias (User Manual Name) for DMA_HRR53.
* To use register names with standard convension, please use DMA_HRR53.
*/
#define	DMA_HRR053	(DMA_HRR53)

/** \\brief  18D8, DMA Channel Hardware Resource Register */
#define DMA_HRR54 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118D8u)

/** Alias (User Manual Name) for DMA_HRR54.
* To use register names with standard convension, please use DMA_HRR54.
*/
#define	DMA_HRR054	(DMA_HRR54)

/** \\brief  18DC, DMA Channel Hardware Resource Register */
#define DMA_HRR55 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118DCu)

/** Alias (User Manual Name) for DMA_HRR55.
* To use register names with standard convension, please use DMA_HRR55.
*/
#define	DMA_HRR055	(DMA_HRR55)

/** \\brief  18E0, DMA Channel Hardware Resource Register */
#define DMA_HRR56 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118E0u)

/** Alias (User Manual Name) for DMA_HRR56.
* To use register names with standard convension, please use DMA_HRR56.
*/
#define	DMA_HRR056	(DMA_HRR56)

/** \\brief  18E4, DMA Channel Hardware Resource Register */
#define DMA_HRR57 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118E4u)

/** Alias (User Manual Name) for DMA_HRR57.
* To use register names with standard convension, please use DMA_HRR57.
*/
#define	DMA_HRR057	(DMA_HRR57)

/** \\brief  18E8, DMA Channel Hardware Resource Register */
#define DMA_HRR58 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF00118E8u)

/** Alias (User Manual Name) for DMA_HRR58.
* To use register names with standard convension, please use DMA_HRR58.
*/
#define	DMA_HRR058	(DMA_HRR58)

