keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  1C78, DMA Suspend Acknowledge Register */
#define DMA_SUSACR30 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C78u)

/** Alias (User Manual Name) for DMA_SUSACR30.
* To use register names with standard convension, please use DMA_SUSACR30.
*/
#define	DMA_SUSACR030	(DMA_SUSACR30)

/** \\brief  1C7C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR31 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C7Cu)

/** Alias (User Manual Name) for DMA_SUSACR31.
* To use register names with standard convension, please use DMA_SUSACR31.
*/
#define	DMA_SUSACR031	(DMA_SUSACR31)

/** \\brief  1C80, DMA Suspend Acknowledge Register */
#define DMA_SUSACR32 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C80u)

/** Alias (User Manual Name) for DMA_SUSACR32.
* To use register names with standard convension, please use DMA_SUSACR32.
*/
#define	DMA_SUSACR032	(DMA_SUSACR32)

/** \\brief  1C84, DMA Suspend Acknowledge Register */
#define DMA_SUSACR33 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C84u)

/** Alias (User Manual Name) for DMA_SUSACR33.
* To use register names with standard convension, please use DMA_SUSACR33.
*/
#define	DMA_SUSACR033	(DMA_SUSACR33)

/** \\brief  1C88, DMA Suspend Acknowledge Register */
#define DMA_SUSACR34 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C88u)

/** Alias (User Manual Name) for DMA_SUSACR34.
* To use register names with standard convension, please use DMA_SUSACR34.
*/
#define	DMA_SUSACR034	(DMA_SUSACR34)

/** \\brief  1C8C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR35 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C8Cu)

/** Alias (User Manual Name) for DMA_SUSACR35.
* To use register names with standard convension, please use DMA_SUSACR35.
*/
#define	DMA_SUSACR035	(DMA_SUSACR35)

/** \\brief  1C90, DMA Suspend Acknowledge Register */
#define DMA_SUSACR36 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C90u)

/** Alias (User Manual Name) for DMA_SUSACR36.
* To use register names with standard convension, please use DMA_SUSACR36.
*/
#define	DMA_SUSACR036	(DMA_SUSACR36)

/** \\brief  1C94, DMA Suspend Acknowledge Register */
#define DMA_SUSACR37 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C94u)

/** Alias (User Manual Name) for DMA_SUSACR37.
* To use register names with standard convension, please use DMA_SUSACR37.
*/
#define	DMA_SUSACR037	(DMA_SUSACR37)

/** \\brief  1C98, DMA Suspend Acknowledge Register */
#define DMA_SUSACR38 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C98u)

/** Alias (User Manual Name) for DMA_SUSACR38.
* To use register names with standard convension, please use DMA_SUSACR38.
*/
#define	DMA_SUSACR038	(DMA_SUSACR38)

/** \\brief  1C9C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR39 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C9Cu)

/** Alias (User Manual Name) for DMA_SUSACR39.
* To use register names with standard convension, please use DMA_SUSACR39.
*/
#define	DMA_SUSACR039	(DMA_SUSACR39)

/** \\brief  1C10, DMA Suspend Acknowledge Register */
#define DMA_SUSACR4 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C10u)

/** Alias (User Manual Name) for DMA_SUSACR4.
* To use register names with standard convension, please use DMA_SUSACR4.
*/
#define	DMA_SUSACR004	(DMA_SUSACR4)

/** \\brief  1CA0, DMA Suspend Acknowledge Register */
#define DMA_SUSACR40 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CA0u)

/** Alias (User Manual Name) for DMA_SUSACR40.
* To use register names with standard convension, please use DMA_SUSACR40.
*/
#define	DMA_SUSACR040	(DMA_SUSACR40)

/** \\brief  1CA4, DMA Suspend Acknowledge Register */
#define DMA_SUSACR41 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CA4u)

/** Alias (User Manual Name) for DMA_SUSACR41.
* To use register names with standard convension, please use DMA_SUSACR41.
*/
#define	DMA_SUSACR041	(DMA_SUSACR41)

/** \\brief  1CA8, DMA Suspend Acknowledge Register */
#define DMA_SUSACR42 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CA8u)

/** Alias (User Manual Name) for DMA_SUSACR42.
* To use register names with standard convension, please use DMA_SUSACR42.
*/
#define	DMA_SUSACR042	(DMA_SUSACR42)

/** \\brief  1CAC, DMA Suspend Acknowledge Register */
#define DMA_SUSACR43 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CACu)

/** Alias (User Manual Name) for DMA_SUSACR43.
* To use register names with standard convension, please use DMA_SUSACR43.
*/
#define	DMA_SUSACR043	(DMA_SUSACR43)

/** \\brief  1CB0, DMA Suspend Acknowledge Register */
#define DMA_SUSACR44 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CB0u)

/** Alias (User Manual Name) for DMA_SUSACR44.
* To use register names with standard convension, please use DMA_SUSACR44.
*/
#define	DMA_SUSACR044	(DMA_SUSACR44)

/** \\brief  1CB4, DMA Suspend Acknowledge Register */
#define DMA_SUSACR45 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CB4u)

/** Alias (User Manual Name) for DMA_SUSACR45.
* To use register names with standard convension, please use DMA_SUSACR45.
*/
#define	DMA_SUSACR045	(DMA_SUSACR45)

/** \\brief  1CB8, DMA Suspend Acknowledge Register */
#define DMA_SUSACR46 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CB8u)

/** Alias (User Manual Name) for DMA_SUSACR46.
* To use register names with standard convension, please use DMA_SUSACR46.
*/
#define	DMA_SUSACR046	(DMA_SUSACR46)

/** \\brief  1CBC, DMA Suspend Acknowledge Register */
#define DMA_SUSACR47 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CBCu)

/** Alias (User Manual Name) for DMA_SUSACR47.
* To use register names with standard convension, please use DMA_SUSACR47.
*/
#define	DMA_SUSACR047	(DMA_SUSACR47)

/** \\brief  1CC0, DMA Suspend Acknowledge Register */
#define DMA_SUSACR48 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CC0u)

/** Alias (User Manual Name) for DMA_SUSACR48.
* To use register names with standard convension, please use DMA_SUSACR48.
*/
#define	DMA_SUSACR048	(DMA_SUSACR48)

/** \\brief  1CC4, DMA Suspend Acknowledge Register */
#define DMA_SUSACR49 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CC4u)

/** Alias (User Manual Name) for DMA_SUSACR49.
* To use register names with standard convension, please use DMA_SUSACR49.
*/
#define	DMA_SUSACR049	(DMA_SUSACR49)

/** \\brief  1C14, DMA Suspend Acknowledge Register */
#define DMA_SUSACR5 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C14u)

/** Alias (User Manual Name) for DMA_SUSACR5.
* To use register names with standard convension, please use DMA_SUSACR5.
*/
#define	DMA_SUSACR005	(DMA_SUSACR5)

/** \\brief  1CC8, DMA Suspend Acknowledge Register */
#define DMA_SUSACR50 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011CC8u)

