keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_SUSACR69.
* To use register names with standard convension, please use DMA_SUSACR69.
*/
#define	DMA_SUSACR069	(DMA_SUSACR69)

/** \\brief  1C1C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR7 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C1Cu)

/** Alias (User Manual Name) for DMA_SUSACR7.
* To use register names with standard convension, please use DMA_SUSACR7.
*/
#define	DMA_SUSACR007	(DMA_SUSACR7)

/** \\brief  1D18, DMA Suspend Acknowledge Register */
#define DMA_SUSACR70 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D18u)

/** Alias (User Manual Name) for DMA_SUSACR70.
* To use register names with standard convension, please use DMA_SUSACR70.
*/
#define	DMA_SUSACR070	(DMA_SUSACR70)

/** \\brief  1D1C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR71 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D1Cu)

/** Alias (User Manual Name) for DMA_SUSACR71.
* To use register names with standard convension, please use DMA_SUSACR71.
*/
#define	DMA_SUSACR071	(DMA_SUSACR71)

/** \\brief  1D20, DMA Suspend Acknowledge Register */
#define DMA_SUSACR72 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D20u)

/** Alias (User Manual Name) for DMA_SUSACR72.
* To use register names with standard convension, please use DMA_SUSACR72.
*/
#define	DMA_SUSACR072	(DMA_SUSACR72)

/** \\brief  1D24, DMA Suspend Acknowledge Register */
#define DMA_SUSACR73 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D24u)

/** Alias (User Manual Name) for DMA_SUSACR73.
* To use register names with standard convension, please use DMA_SUSACR73.
*/
#define	DMA_SUSACR073	(DMA_SUSACR73)

/** \\brief  1D28, DMA Suspend Acknowledge Register */
#define DMA_SUSACR74 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D28u)

/** Alias (User Manual Name) for DMA_SUSACR74.
* To use register names with standard convension, please use DMA_SUSACR74.
*/
#define	DMA_SUSACR074	(DMA_SUSACR74)

/** \\brief  1D2C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR75 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D2Cu)

/** Alias (User Manual Name) for DMA_SUSACR75.
* To use register names with standard convension, please use DMA_SUSACR75.
*/
#define	DMA_SUSACR075	(DMA_SUSACR75)

/** \\brief  1D30, DMA Suspend Acknowledge Register */
#define DMA_SUSACR76 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D30u)

/** Alias (User Manual Name) for DMA_SUSACR76.
* To use register names with standard convension, please use DMA_SUSACR76.
*/
#define	DMA_SUSACR076	(DMA_SUSACR76)

/** \\brief  1D34, DMA Suspend Acknowledge Register */
#define DMA_SUSACR77 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D34u)

/** Alias (User Manual Name) for DMA_SUSACR77.
* To use register names with standard convension, please use DMA_SUSACR77.
*/
#define	DMA_SUSACR077	(DMA_SUSACR77)

/** \\brief  1D38, DMA Suspend Acknowledge Register */
#define DMA_SUSACR78 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D38u)

/** Alias (User Manual Name) for DMA_SUSACR78.
* To use register names with standard convension, please use DMA_SUSACR78.
*/
#define	DMA_SUSACR078	(DMA_SUSACR78)

/** \\brief  1D3C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR79 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D3Cu)

/** Alias (User Manual Name) for DMA_SUSACR79.
* To use register names with standard convension, please use DMA_SUSACR79.
*/
#define	DMA_SUSACR079	(DMA_SUSACR79)

/** \\brief  1C20, DMA Suspend Acknowledge Register */
#define DMA_SUSACR8 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011C20u)

/** Alias (User Manual Name) for DMA_SUSACR8.
* To use register names with standard convension, please use DMA_SUSACR8.
*/
#define	DMA_SUSACR008	(DMA_SUSACR8)

/** \\brief  1D40, DMA Suspend Acknowledge Register */
#define DMA_SUSACR80 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D40u)

/** Alias (User Manual Name) for DMA_SUSACR80.
* To use register names with standard convension, please use DMA_SUSACR80.
*/
#define	DMA_SUSACR080	(DMA_SUSACR80)

/** \\brief  1D44, DMA Suspend Acknowledge Register */
#define DMA_SUSACR81 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D44u)

/** Alias (User Manual Name) for DMA_SUSACR81.
* To use register names with standard convension, please use DMA_SUSACR81.
*/
#define	DMA_SUSACR081	(DMA_SUSACR81)

/** \\brief  1D48, DMA Suspend Acknowledge Register */
#define DMA_SUSACR82 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D48u)

/** Alias (User Manual Name) for DMA_SUSACR82.
* To use register names with standard convension, please use DMA_SUSACR82.
*/
#define	DMA_SUSACR082	(DMA_SUSACR82)

/** \\brief  1D4C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR83 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D4Cu)

/** Alias (User Manual Name) for DMA_SUSACR83.
* To use register names with standard convension, please use DMA_SUSACR83.
*/
#define	DMA_SUSACR083	(DMA_SUSACR83)

/** \\brief  1D50, DMA Suspend Acknowledge Register */
#define DMA_SUSACR84 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D50u)

/** Alias (User Manual Name) for DMA_SUSACR84.
* To use register names with standard convension, please use DMA_SUSACR84.
*/
#define	DMA_SUSACR084	(DMA_SUSACR84)

/** \\brief  1D54, DMA Suspend Acknowledge Register */
#define DMA_SUSACR85 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D54u)

/** Alias (User Manual Name) for DMA_SUSACR85.
* To use register names with standard convension, please use DMA_SUSACR85.
*/
#define	DMA_SUSACR085	(DMA_SUSACR85)

/** \\brief  1D58, DMA Suspend Acknowledge Register */
#define DMA_SUSACR86 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D58u)

/** Alias (User Manual Name) for DMA_SUSACR86.
* To use register names with standard convension, please use DMA_SUSACR86.
*/
#define	DMA_SUSACR086	(DMA_SUSACR86)

/** \\brief  1D5C, DMA Suspend Acknowledge Register */
#define DMA_SUSACR87 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSACR*)0xF0011D5Cu)

