keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  1BC8, DMA Suspend Enable Register */
#define DMA_SUSENR114 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BC8u)

/** \\brief  1BCC, DMA Suspend Enable Register */
#define DMA_SUSENR115 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BCCu)

/** \\brief  1BD0, DMA Suspend Enable Register */
#define DMA_SUSENR116 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BD0u)

/** \\brief  1BD4, DMA Suspend Enable Register */
#define DMA_SUSENR117 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BD4u)

/** \\brief  1BD8, DMA Suspend Enable Register */
#define DMA_SUSENR118 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BD8u)

/** \\brief  1BDC, DMA Suspend Enable Register */
#define DMA_SUSENR119 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BDCu)

/** \\brief  1A30, DMA Suspend Enable Register */
#define DMA_SUSENR12 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A30u)

/** Alias (User Manual Name) for DMA_SUSENR12.
* To use register names with standard convension, please use DMA_SUSENR12.
*/
#define	DMA_SUSENR012	(DMA_SUSENR12)

/** \\brief  1BE0, DMA Suspend Enable Register */
#define DMA_SUSENR120 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BE0u)

/** \\brief  1BE4, DMA Suspend Enable Register */
#define DMA_SUSENR121 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BE4u)

/** \\brief  1BE8, DMA Suspend Enable Register */
#define DMA_SUSENR122 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BE8u)

/** \\brief  1BEC, DMA Suspend Enable Register */
#define DMA_SUSENR123 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BECu)

/** \\brief  1BF0, DMA Suspend Enable Register */
#define DMA_SUSENR124 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BF0u)

/** \\brief  1BF4, DMA Suspend Enable Register */
#define DMA_SUSENR125 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BF4u)

/** \\brief  1BF8, DMA Suspend Enable Register */
#define DMA_SUSENR126 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BF8u)

/** \\brief  1BFC, DMA Suspend Enable Register */
#define DMA_SUSENR127 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011BFCu)

/** \\brief  1A34, DMA Suspend Enable Register */
#define DMA_SUSENR13 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A34u)

/** Alias (User Manual Name) for DMA_SUSENR13.
* To use register names with standard convension, please use DMA_SUSENR13.
*/
#define	DMA_SUSENR013	(DMA_SUSENR13)

/** \\brief  1A38, DMA Suspend Enable Register */
#define DMA_SUSENR14 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A38u)

/** Alias (User Manual Name) for DMA_SUSENR14.
* To use register names with standard convension, please use DMA_SUSENR14.
*/
#define	DMA_SUSENR014	(DMA_SUSENR14)

/** \\brief  1A3C, DMA Suspend Enable Register */
#define DMA_SUSENR15 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A3Cu)

/** Alias (User Manual Name) for DMA_SUSENR15.
* To use register names with standard convension, please use DMA_SUSENR15.
*/
#define	DMA_SUSENR015	(DMA_SUSENR15)

/** \\brief  1A40, DMA Suspend Enable Register */
#define DMA_SUSENR16 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A40u)

/** Alias (User Manual Name) for DMA_SUSENR16.
* To use register names with standard convension, please use DMA_SUSENR16.
*/
#define	DMA_SUSENR016	(DMA_SUSENR16)

/** \\brief  1A44, DMA Suspend Enable Register */
#define DMA_SUSENR17 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A44u)

/** Alias (User Manual Name) for DMA_SUSENR17.
* To use register names with standard convension, please use DMA_SUSENR17.
*/
#define	DMA_SUSENR017	(DMA_SUSENR17)

/** \\brief  1A48, DMA Suspend Enable Register */
#define DMA_SUSENR18 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A48u)

/** Alias (User Manual Name) for DMA_SUSENR18.
* To use register names with standard convension, please use DMA_SUSENR18.
*/
#define	DMA_SUSENR018	(DMA_SUSENR18)

/** \\brief  1A4C, DMA Suspend Enable Register */
#define DMA_SUSENR19 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A4Cu)

/** Alias (User Manual Name) for DMA_SUSENR19.
* To use register names with standard convension, please use DMA_SUSENR19.
*/
#define	DMA_SUSENR019	(DMA_SUSENR19)

/** \\brief  1A08, DMA Suspend Enable Register */
#define DMA_SUSENR2 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A08u)

/** Alias (User Manual Name) for DMA_SUSENR2.
* To use register names with standard convension, please use DMA_SUSENR2.
*/
#define	DMA_SUSENR002	(DMA_SUSENR2)

/** \\brief  1A50, DMA Suspend Enable Register */
#define DMA_SUSENR20 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A50u)

/** Alias (User Manual Name) for DMA_SUSENR20.
* To use register names with standard convension, please use DMA_SUSENR20.
*/
#define	DMA_SUSENR020	(DMA_SUSENR20)

/** \\brief  1A54, DMA Suspend Enable Register */
#define DMA_SUSENR21 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A54u)

/** Alias (User Manual Name) for DMA_SUSENR21.
* To use register names with standard convension, please use DMA_SUSENR21.
*/
#define	DMA_SUSENR021	(DMA_SUSENR21)

/** \\brief  1A58, DMA Suspend Enable Register */
#define DMA_SUSENR22 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A58u)

/** Alias (User Manual Name) for DMA_SUSENR22.
* To use register names with standard convension, please use DMA_SUSENR22.
*/
#define	DMA_SUSENR022	(DMA_SUSENR22)

/** \\brief  1A5C, DMA Suspend Enable Register */
#define DMA_SUSENR23 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A5Cu)

/** Alias (User Manual Name) for DMA_SUSENR23.
* To use register names with standard convension, please use DMA_SUSENR23.
*/
#define	DMA_SUSENR023	(DMA_SUSENR23)

/** \\brief  1A60, DMA Suspend Enable Register */
#define DMA_SUSENR24 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A60u)

/** Alias (User Manual Name) for DMA_SUSENR24.
* To use register names with standard convension, please use DMA_SUSENR24.
*/
#define	DMA_SUSENR024	(DMA_SUSENR24)

/** \\brief  1A64, DMA Suspend Enable Register */
#define DMA_SUSENR25 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A64u)

/** Alias (User Manual Name) for DMA_SUSENR25.
* To use register names with standard convension, please use DMA_SUSENR25.
*/
#define	DMA_SUSENR025	(DMA_SUSENR25)

/** \\brief  1A68, DMA Suspend Enable Register */
#define DMA_SUSENR26 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A68u)

