keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_SUSENR44.
* To use register names with standard convension, please use DMA_SUSENR44.
*/
#define	DMA_SUSENR044	(DMA_SUSENR44)

/** \\brief  1AB4, DMA Suspend Enable Register */
#define DMA_SUSENR45 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AB4u)

/** Alias (User Manual Name) for DMA_SUSENR45.
* To use register names with standard convension, please use DMA_SUSENR45.
*/
#define	DMA_SUSENR045	(DMA_SUSENR45)

/** \\brief  1AB8, DMA Suspend Enable Register */
#define DMA_SUSENR46 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AB8u)

/** Alias (User Manual Name) for DMA_SUSENR46.
* To use register names with standard convension, please use DMA_SUSENR46.
*/
#define	DMA_SUSENR046	(DMA_SUSENR46)

/** \\brief  1ABC, DMA Suspend Enable Register */
#define DMA_SUSENR47 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011ABCu)

/** Alias (User Manual Name) for DMA_SUSENR47.
* To use register names with standard convension, please use DMA_SUSENR47.
*/
#define	DMA_SUSENR047	(DMA_SUSENR47)

/** \\brief  1AC0, DMA Suspend Enable Register */
#define DMA_SUSENR48 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AC0u)

/** Alias (User Manual Name) for DMA_SUSENR48.
* To use register names with standard convension, please use DMA_SUSENR48.
*/
#define	DMA_SUSENR048	(DMA_SUSENR48)

/** \\brief  1AC4, DMA Suspend Enable Register */
#define DMA_SUSENR49 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AC4u)

/** Alias (User Manual Name) for DMA_SUSENR49.
* To use register names with standard convension, please use DMA_SUSENR49.
*/
#define	DMA_SUSENR049	(DMA_SUSENR49)

/** \\brief  1A14, DMA Suspend Enable Register */
#define DMA_SUSENR5 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A14u)

/** Alias (User Manual Name) for DMA_SUSENR5.
* To use register names with standard convension, please use DMA_SUSENR5.
*/
#define	DMA_SUSENR005	(DMA_SUSENR5)

/** \\brief  1AC8, DMA Suspend Enable Register */
#define DMA_SUSENR50 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AC8u)

/** Alias (User Manual Name) for DMA_SUSENR50.
* To use register names with standard convension, please use DMA_SUSENR50.
*/
#define	DMA_SUSENR050	(DMA_SUSENR50)

/** \\brief  1ACC, DMA Suspend Enable Register */
#define DMA_SUSENR51 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011ACCu)

/** Alias (User Manual Name) for DMA_SUSENR51.
* To use register names with standard convension, please use DMA_SUSENR51.
*/
#define	DMA_SUSENR051	(DMA_SUSENR51)

/** \\brief  1AD0, DMA Suspend Enable Register */
#define DMA_SUSENR52 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AD0u)

/** Alias (User Manual Name) for DMA_SUSENR52.
* To use register names with standard convension, please use DMA_SUSENR52.
*/
#define	DMA_SUSENR052	(DMA_SUSENR52)

/** \\brief  1AD4, DMA Suspend Enable Register */
#define DMA_SUSENR53 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AD4u)

/** Alias (User Manual Name) for DMA_SUSENR53.
* To use register names with standard convension, please use DMA_SUSENR53.
*/
#define	DMA_SUSENR053	(DMA_SUSENR53)

/** \\brief  1AD8, DMA Suspend Enable Register */
#define DMA_SUSENR54 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AD8u)

/** Alias (User Manual Name) for DMA_SUSENR54.
* To use register names with standard convension, please use DMA_SUSENR54.
*/
#define	DMA_SUSENR054	(DMA_SUSENR54)

/** \\brief  1ADC, DMA Suspend Enable Register */
#define DMA_SUSENR55 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011ADCu)

/** Alias (User Manual Name) for DMA_SUSENR55.
* To use register names with standard convension, please use DMA_SUSENR55.
*/
#define	DMA_SUSENR055	(DMA_SUSENR55)

/** \\brief  1AE0, DMA Suspend Enable Register */
#define DMA_SUSENR56 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AE0u)

/** Alias (User Manual Name) for DMA_SUSENR56.
* To use register names with standard convension, please use DMA_SUSENR56.
*/
#define	DMA_SUSENR056	(DMA_SUSENR56)

/** \\brief  1AE4, DMA Suspend Enable Register */
#define DMA_SUSENR57 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AE4u)

/** Alias (User Manual Name) for DMA_SUSENR57.
* To use register names with standard convension, please use DMA_SUSENR57.
*/
#define	DMA_SUSENR057	(DMA_SUSENR57)

/** \\brief  1AE8, DMA Suspend Enable Register */
#define DMA_SUSENR58 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AE8u)

/** Alias (User Manual Name) for DMA_SUSENR58.
* To use register names with standard convension, please use DMA_SUSENR58.
*/
#define	DMA_SUSENR058	(DMA_SUSENR58)

/** \\brief  1AEC, DMA Suspend Enable Register */
#define DMA_SUSENR59 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AECu)

/** Alias (User Manual Name) for DMA_SUSENR59.
* To use register names with standard convension, please use DMA_SUSENR59.
*/
#define	DMA_SUSENR059	(DMA_SUSENR59)

/** \\brief  1A18, DMA Suspend Enable Register */
#define DMA_SUSENR6 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A18u)

/** Alias (User Manual Name) for DMA_SUSENR6.
* To use register names with standard convension, please use DMA_SUSENR6.
*/
#define	DMA_SUSENR006	(DMA_SUSENR6)

/** \\brief  1AF0, DMA Suspend Enable Register */
#define DMA_SUSENR60 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AF0u)

/** Alias (User Manual Name) for DMA_SUSENR60.
* To use register names with standard convension, please use DMA_SUSENR60.
*/
#define	DMA_SUSENR060	(DMA_SUSENR60)

/** \\brief  1AF4, DMA Suspend Enable Register */
#define DMA_SUSENR61 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AF4u)

/** Alias (User Manual Name) for DMA_SUSENR61.
* To use register names with standard convension, please use DMA_SUSENR61.
*/
#define	DMA_SUSENR061	(DMA_SUSENR61)

/** \\brief  1AF8, DMA Suspend Enable Register */
#define DMA_SUSENR62 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AF8u)

