keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_SUSENR62.
* To use register names with standard convension, please use DMA_SUSENR62.
*/
#define	DMA_SUSENR062	(DMA_SUSENR62)

/** \\brief  1AFC, DMA Suspend Enable Register */
#define DMA_SUSENR63 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011AFCu)

/** Alias (User Manual Name) for DMA_SUSENR63.
* To use register names with standard convension, please use DMA_SUSENR63.
*/
#define	DMA_SUSENR063	(DMA_SUSENR63)

/** \\brief  1B00, DMA Suspend Enable Register */
#define DMA_SUSENR64 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B00u)

/** Alias (User Manual Name) for DMA_SUSENR64.
* To use register names with standard convension, please use DMA_SUSENR64.
*/
#define	DMA_SUSENR064	(DMA_SUSENR64)

/** \\brief  1B04, DMA Suspend Enable Register */
#define DMA_SUSENR65 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B04u)

/** Alias (User Manual Name) for DMA_SUSENR65.
* To use register names with standard convension, please use DMA_SUSENR65.
*/
#define	DMA_SUSENR065	(DMA_SUSENR65)

/** \\brief  1B08, DMA Suspend Enable Register */
#define DMA_SUSENR66 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B08u)

/** Alias (User Manual Name) for DMA_SUSENR66.
* To use register names with standard convension, please use DMA_SUSENR66.
*/
#define	DMA_SUSENR066	(DMA_SUSENR66)

/** \\brief  1B0C, DMA Suspend Enable Register */
#define DMA_SUSENR67 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B0Cu)

/** Alias (User Manual Name) for DMA_SUSENR67.
* To use register names with standard convension, please use DMA_SUSENR67.
*/
#define	DMA_SUSENR067	(DMA_SUSENR67)

/** \\brief  1B10, DMA Suspend Enable Register */
#define DMA_SUSENR68 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B10u)

/** Alias (User Manual Name) for DMA_SUSENR68.
* To use register names with standard convension, please use DMA_SUSENR68.
*/
#define	DMA_SUSENR068	(DMA_SUSENR68)

/** \\brief  1B14, DMA Suspend Enable Register */
#define DMA_SUSENR69 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B14u)

/** Alias (User Manual Name) for DMA_SUSENR69.
* To use register names with standard convension, please use DMA_SUSENR69.
*/
#define	DMA_SUSENR069	(DMA_SUSENR69)

/** \\brief  1A1C, DMA Suspend Enable Register */
#define DMA_SUSENR7 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A1Cu)

/** Alias (User Manual Name) for DMA_SUSENR7.
* To use register names with standard convension, please use DMA_SUSENR7.
*/
#define	DMA_SUSENR007	(DMA_SUSENR7)

/** \\brief  1B18, DMA Suspend Enable Register */
#define DMA_SUSENR70 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B18u)

/** Alias (User Manual Name) for DMA_SUSENR70.
* To use register names with standard convension, please use DMA_SUSENR70.
*/
#define	DMA_SUSENR070	(DMA_SUSENR70)

/** \\brief  1B1C, DMA Suspend Enable Register */
#define DMA_SUSENR71 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B1Cu)

/** Alias (User Manual Name) for DMA_SUSENR71.
* To use register names with standard convension, please use DMA_SUSENR71.
*/
#define	DMA_SUSENR071	(DMA_SUSENR71)

/** \\brief  1B20, DMA Suspend Enable Register */
#define DMA_SUSENR72 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B20u)

/** Alias (User Manual Name) for DMA_SUSENR72.
* To use register names with standard convension, please use DMA_SUSENR72.
*/
#define	DMA_SUSENR072	(DMA_SUSENR72)

/** \\brief  1B24, DMA Suspend Enable Register */
#define DMA_SUSENR73 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B24u)

/** Alias (User Manual Name) for DMA_SUSENR73.
* To use register names with standard convension, please use DMA_SUSENR73.
*/
#define	DMA_SUSENR073	(DMA_SUSENR73)

/** \\brief  1B28, DMA Suspend Enable Register */
#define DMA_SUSENR74 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B28u)

/** Alias (User Manual Name) for DMA_SUSENR74.
* To use register names with standard convension, please use DMA_SUSENR74.
*/
#define	DMA_SUSENR074	(DMA_SUSENR74)

/** \\brief  1B2C, DMA Suspend Enable Register */
#define DMA_SUSENR75 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B2Cu)

/** Alias (User Manual Name) for DMA_SUSENR75.
* To use register names with standard convension, please use DMA_SUSENR75.
*/
#define	DMA_SUSENR075	(DMA_SUSENR75)

/** \\brief  1B30, DMA Suspend Enable Register */
#define DMA_SUSENR76 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B30u)

/** Alias (User Manual Name) for DMA_SUSENR76.
* To use register names with standard convension, please use DMA_SUSENR76.
*/
#define	DMA_SUSENR076	(DMA_SUSENR76)

/** \\brief  1B34, DMA Suspend Enable Register */
#define DMA_SUSENR77 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B34u)

/** Alias (User Manual Name) for DMA_SUSENR77.
* To use register names with standard convension, please use DMA_SUSENR77.
*/
#define	DMA_SUSENR077	(DMA_SUSENR77)

/** \\brief  1B38, DMA Suspend Enable Register */
#define DMA_SUSENR78 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B38u)

/** Alias (User Manual Name) for DMA_SUSENR78.
* To use register names with standard convension, please use DMA_SUSENR78.
*/
#define	DMA_SUSENR078	(DMA_SUSENR78)

/** \\brief  1B3C, DMA Suspend Enable Register */
#define DMA_SUSENR79 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B3Cu)

/** Alias (User Manual Name) for DMA_SUSENR79.
* To use register names with standard convension, please use DMA_SUSENR79.
*/
#define	DMA_SUSENR079	(DMA_SUSENR79)

/** \\brief  1A20, DMA Suspend Enable Register */
#define DMA_SUSENR8 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A20u)

/** Alias (User Manual Name) for DMA_SUSENR8.
* To use register names with standard convension, please use DMA_SUSENR8.
*/
#define	DMA_SUSENR008	(DMA_SUSENR8)

/** \\brief  1B40, DMA Suspend Enable Register */
#define DMA_SUSENR80 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B40u)

