keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_SUSENR80.
* To use register names with standard convension, please use DMA_SUSENR80.
*/
#define	DMA_SUSENR080	(DMA_SUSENR80)

/** \\brief  1B44, DMA Suspend Enable Register */
#define DMA_SUSENR81 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B44u)

/** Alias (User Manual Name) for DMA_SUSENR81.
* To use register names with standard convension, please use DMA_SUSENR81.
*/
#define	DMA_SUSENR081	(DMA_SUSENR81)

/** \\brief  1B48, DMA Suspend Enable Register */
#define DMA_SUSENR82 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B48u)

/** Alias (User Manual Name) for DMA_SUSENR82.
* To use register names with standard convension, please use DMA_SUSENR82.
*/
#define	DMA_SUSENR082	(DMA_SUSENR82)

/** \\brief  1B4C, DMA Suspend Enable Register */
#define DMA_SUSENR83 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B4Cu)

/** Alias (User Manual Name) for DMA_SUSENR83.
* To use register names with standard convension, please use DMA_SUSENR83.
*/
#define	DMA_SUSENR083	(DMA_SUSENR83)

/** \\brief  1B50, DMA Suspend Enable Register */
#define DMA_SUSENR84 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B50u)

/** Alias (User Manual Name) for DMA_SUSENR84.
* To use register names with standard convension, please use DMA_SUSENR84.
*/
#define	DMA_SUSENR084	(DMA_SUSENR84)

/** \\brief  1B54, DMA Suspend Enable Register */
#define DMA_SUSENR85 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B54u)

/** Alias (User Manual Name) for DMA_SUSENR85.
* To use register names with standard convension, please use DMA_SUSENR85.
*/
#define	DMA_SUSENR085	(DMA_SUSENR85)

/** \\brief  1B58, DMA Suspend Enable Register */
#define DMA_SUSENR86 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B58u)

/** Alias (User Manual Name) for DMA_SUSENR86.
* To use register names with standard convension, please use DMA_SUSENR86.
*/
#define	DMA_SUSENR086	(DMA_SUSENR86)

/** \\brief  1B5C, DMA Suspend Enable Register */
#define DMA_SUSENR87 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B5Cu)

/** Alias (User Manual Name) for DMA_SUSENR87.
* To use register names with standard convension, please use DMA_SUSENR87.
*/
#define	DMA_SUSENR087	(DMA_SUSENR87)

/** \\brief  1B60, DMA Suspend Enable Register */
#define DMA_SUSENR88 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B60u)

/** Alias (User Manual Name) for DMA_SUSENR88.
* To use register names with standard convension, please use DMA_SUSENR88.
*/
#define	DMA_SUSENR088	(DMA_SUSENR88)

/** \\brief  1B64, DMA Suspend Enable Register */
#define DMA_SUSENR89 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B64u)

/** Alias (User Manual Name) for DMA_SUSENR89.
* To use register names with standard convension, please use DMA_SUSENR89.
*/
#define	DMA_SUSENR089	(DMA_SUSENR89)

/** \\brief  1A24, DMA Suspend Enable Register */
#define DMA_SUSENR9 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011A24u)

/** Alias (User Manual Name) for DMA_SUSENR9.
* To use register names with standard convension, please use DMA_SUSENR9.
*/
#define	DMA_SUSENR009	(DMA_SUSENR9)

/** \\brief  1B68, DMA Suspend Enable Register */
#define DMA_SUSENR90 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B68u)

/** Alias (User Manual Name) for DMA_SUSENR90.
* To use register names with standard convension, please use DMA_SUSENR90.
*/
#define	DMA_SUSENR090	(DMA_SUSENR90)

/** \\brief  1B6C, DMA Suspend Enable Register */
#define DMA_SUSENR91 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B6Cu)

/** Alias (User Manual Name) for DMA_SUSENR91.
* To use register names with standard convension, please use DMA_SUSENR91.
*/
#define	DMA_SUSENR091	(DMA_SUSENR91)

/** \\brief  1B70, DMA Suspend Enable Register */
#define DMA_SUSENR92 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B70u)

/** Alias (User Manual Name) for DMA_SUSENR92.
* To use register names with standard convension, please use DMA_SUSENR92.
*/
#define	DMA_SUSENR092	(DMA_SUSENR92)

/** \\brief  1B74, DMA Suspend Enable Register */
#define DMA_SUSENR93 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B74u)

/** Alias (User Manual Name) for DMA_SUSENR93.
* To use register names with standard convension, please use DMA_SUSENR93.
*/
#define	DMA_SUSENR093	(DMA_SUSENR93)

/** \\brief  1B78, DMA Suspend Enable Register */
#define DMA_SUSENR94 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B78u)

/** Alias (User Manual Name) for DMA_SUSENR94.
* To use register names with standard convension, please use DMA_SUSENR94.
*/
#define	DMA_SUSENR094	(DMA_SUSENR94)

/** \\brief  1B7C, DMA Suspend Enable Register */
#define DMA_SUSENR95 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B7Cu)

/** Alias (User Manual Name) for DMA_SUSENR95.
* To use register names with standard convension, please use DMA_SUSENR95.
*/
#define	DMA_SUSENR095	(DMA_SUSENR95)

/** \\brief  1B80, DMA Suspend Enable Register */
#define DMA_SUSENR96 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B80u)

/** Alias (User Manual Name) for DMA_SUSENR96.
* To use register names with standard convension, please use DMA_SUSENR96.
*/
#define	DMA_SUSENR096	(DMA_SUSENR96)

/** \\brief  1B84, DMA Suspend Enable Register */
#define DMA_SUSENR97 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B84u)

/** Alias (User Manual Name) for DMA_SUSENR97.
* To use register names with standard convension, please use DMA_SUSENR97.
*/
#define	DMA_SUSENR097	(DMA_SUSENR97)

/** \\brief  1B88, DMA Suspend Enable Register */
#define DMA_SUSENR98 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B88u)

/** Alias (User Manual Name) for DMA_SUSENR98.
* To use register names with standard convension, please use DMA_SUSENR98.
*/
#define	DMA_SUSENR098	(DMA_SUSENR98)

/** \\brief  1B8C, DMA Suspend Enable Register */
#define DMA_SUSENR99 /*lint --e(923)*/ (*(volatile Ifx_DMA_SUSENR*)0xF0011B8Cu)

/** Alias (User Manual Name) for DMA_SUSENR99.
* To use register names with standard convension, please use DMA_SUSENR99.
*/
#define	DMA_SUSENR099	(DMA_SUSENR99)

/** \\brief  1210, Time Register */
#define DMA_TIME /*lint --e(923)*/ (*(volatile Ifx_DMA_TIME*)0xF0011210u)

/** \\brief  1E00, DMA Transaction State Register */
#define DMA_TSR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E00u)

/** Alias (User Manual Name) for DMA_TSR0.
* To use register names with standard convension, please use DMA_TSR0.
*/
#define	DMA_TSR000	(DMA_TSR0)

