keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** \\brief  1E04, DMA Transaction State Register */
#define DMA_TSR1 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E04u)

/** Alias (User Manual Name) for DMA_TSR1.
* To use register names with standard convension, please use DMA_TSR1.
*/
#define	DMA_TSR001	(DMA_TSR1)

/** \\brief  1E28, DMA Transaction State Register */
#define DMA_TSR10 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E28u)

/** Alias (User Manual Name) for DMA_TSR10.
* To use register names with standard convension, please use DMA_TSR10.
*/
#define	DMA_TSR010	(DMA_TSR10)

/** \\brief  1F90, DMA Transaction State Register */
#define DMA_TSR100 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F90u)

/** \\brief  1F94, DMA Transaction State Register */
#define DMA_TSR101 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F94u)

/** \\brief  1F98, DMA Transaction State Register */
#define DMA_TSR102 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F98u)

/** \\brief  1F9C, DMA Transaction State Register */
#define DMA_TSR103 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F9Cu)

/** \\brief  1FA0, DMA Transaction State Register */
#define DMA_TSR104 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FA0u)

/** \\brief  1FA4, DMA Transaction State Register */
#define DMA_TSR105 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FA4u)

/** \\brief  1FA8, DMA Transaction State Register */
#define DMA_TSR106 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FA8u)

/** \\brief  1FAC, DMA Transaction State Register */
#define DMA_TSR107 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FACu)

/** \\brief  1FB0, DMA Transaction State Register */
#define DMA_TSR108 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FB0u)

/** \\brief  1FB4, DMA Transaction State Register */
#define DMA_TSR109 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FB4u)

/** \\brief  1E2C, DMA Transaction State Register */
#define DMA_TSR11 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E2Cu)

/** Alias (User Manual Name) for DMA_TSR11.
* To use register names with standard convension, please use DMA_TSR11.
*/
#define	DMA_TSR011	(DMA_TSR11)

/** \\brief  1FB8, DMA Transaction State Register */
#define DMA_TSR110 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FB8u)

/** \\brief  1FBC, DMA Transaction State Register */
#define DMA_TSR111 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FBCu)

/** \\brief  1FC0, DMA Transaction State Register */
#define DMA_TSR112 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FC0u)

/** \\brief  1FC4, DMA Transaction State Register */
#define DMA_TSR113 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FC4u)

/** \\brief  1FC8, DMA Transaction State Register */
#define DMA_TSR114 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FC8u)

/** \\brief  1FCC, DMA Transaction State Register */
#define DMA_TSR115 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FCCu)

/** \\brief  1FD0, DMA Transaction State Register */
#define DMA_TSR116 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FD0u)

/** \\brief  1FD4, DMA Transaction State Register */
#define DMA_TSR117 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FD4u)

/** \\brief  1FD8, DMA Transaction State Register */
#define DMA_TSR118 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FD8u)

/** \\brief  1FDC, DMA Transaction State Register */
#define DMA_TSR119 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FDCu)

/** \\brief  1E30, DMA Transaction State Register */
#define DMA_TSR12 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E30u)

/** Alias (User Manual Name) for DMA_TSR12.
* To use register names with standard convension, please use DMA_TSR12.
*/
#define	DMA_TSR012	(DMA_TSR12)

/** \\brief  1FE0, DMA Transaction State Register */
#define DMA_TSR120 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FE0u)

/** \\brief  1FE4, DMA Transaction State Register */
#define DMA_TSR121 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FE4u)

/** \\brief  1FE8, DMA Transaction State Register */
#define DMA_TSR122 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FE8u)

/** \\brief  1FEC, DMA Transaction State Register */
#define DMA_TSR123 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FECu)

/** \\brief  1FF0, DMA Transaction State Register */
#define DMA_TSR124 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FF0u)

/** \\brief  1FF4, DMA Transaction State Register */
#define DMA_TSR125 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FF4u)

/** \\brief  1FF8, DMA Transaction State Register */
#define DMA_TSR126 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FF8u)

/** \\brief  1FFC, DMA Transaction State Register */
#define DMA_TSR127 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011FFCu)

/** \\brief  1E34, DMA Transaction State Register */
#define DMA_TSR13 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E34u)

/** Alias (User Manual Name) for DMA_TSR13.
* To use register names with standard convension, please use DMA_TSR13.
*/
#define	DMA_TSR013	(DMA_TSR13)

/** \\brief  1E38, DMA Transaction State Register */
#define DMA_TSR14 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E38u)

/** Alias (User Manual Name) for DMA_TSR14.
* To use register names with standard convension, please use DMA_TSR14.
*/
#define	DMA_TSR014	(DMA_TSR14)

/** \\brief  1E3C, DMA Transaction State Register */
#define DMA_TSR15 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E3Cu)

/** Alias (User Manual Name) for DMA_TSR15.
* To use register names with standard convension, please use DMA_TSR15.
*/
#define	DMA_TSR015	(DMA_TSR15)

/** \\brief  1E40, DMA Transaction State Register */
#define DMA_TSR16 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E40u)

/** Alias (User Manual Name) for DMA_TSR16.
* To use register names with standard convension, please use DMA_TSR16.
*/
#define	DMA_TSR016	(DMA_TSR16)

/** \\brief  1E44, DMA Transaction State Register */
#define DMA_TSR17 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E44u)

