keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_TSR79.
* To use register names with standard convension, please use DMA_TSR79.
*/
#define	DMA_TSR079	(DMA_TSR79)

/** \\brief  1E20, DMA Transaction State Register */
#define DMA_TSR8 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E20u)

/** Alias (User Manual Name) for DMA_TSR8.
* To use register names with standard convension, please use DMA_TSR8.
*/
#define	DMA_TSR008	(DMA_TSR8)

/** \\brief  1F40, DMA Transaction State Register */
#define DMA_TSR80 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F40u)

/** Alias (User Manual Name) for DMA_TSR80.
* To use register names with standard convension, please use DMA_TSR80.
*/
#define	DMA_TSR080	(DMA_TSR80)

/** \\brief  1F44, DMA Transaction State Register */
#define DMA_TSR81 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F44u)

/** Alias (User Manual Name) for DMA_TSR81.
* To use register names with standard convension, please use DMA_TSR81.
*/
#define	DMA_TSR081	(DMA_TSR81)

/** \\brief  1F48, DMA Transaction State Register */
#define DMA_TSR82 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F48u)

/** Alias (User Manual Name) for DMA_TSR82.
* To use register names with standard convension, please use DMA_TSR82.
*/
#define	DMA_TSR082	(DMA_TSR82)

/** \\brief  1F4C, DMA Transaction State Register */
#define DMA_TSR83 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F4Cu)

/** Alias (User Manual Name) for DMA_TSR83.
* To use register names with standard convension, please use DMA_TSR83.
*/
#define	DMA_TSR083	(DMA_TSR83)

/** \\brief  1F50, DMA Transaction State Register */
#define DMA_TSR84 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F50u)

/** Alias (User Manual Name) for DMA_TSR84.
* To use register names with standard convension, please use DMA_TSR84.
*/
#define	DMA_TSR084	(DMA_TSR84)

/** \\brief  1F54, DMA Transaction State Register */
#define DMA_TSR85 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F54u)

/** Alias (User Manual Name) for DMA_TSR85.
* To use register names with standard convension, please use DMA_TSR85.
*/
#define	DMA_TSR085	(DMA_TSR85)

/** \\brief  1F58, DMA Transaction State Register */
#define DMA_TSR86 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F58u)

/** Alias (User Manual Name) for DMA_TSR86.
* To use register names with standard convension, please use DMA_TSR86.
*/
#define	DMA_TSR086	(DMA_TSR86)

/** \\brief  1F5C, DMA Transaction State Register */
#define DMA_TSR87 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F5Cu)

/** Alias (User Manual Name) for DMA_TSR87.
* To use register names with standard convension, please use DMA_TSR87.
*/
#define	DMA_TSR087	(DMA_TSR87)

/** \\brief  1F60, DMA Transaction State Register */
#define DMA_TSR88 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F60u)

/** Alias (User Manual Name) for DMA_TSR88.
* To use register names with standard convension, please use DMA_TSR88.
*/
#define	DMA_TSR088	(DMA_TSR88)

/** \\brief  1F64, DMA Transaction State Register */
#define DMA_TSR89 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F64u)

/** Alias (User Manual Name) for DMA_TSR89.
* To use register names with standard convension, please use DMA_TSR89.
*/
#define	DMA_TSR089	(DMA_TSR89)

/** \\brief  1E24, DMA Transaction State Register */
#define DMA_TSR9 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011E24u)

/** Alias (User Manual Name) for DMA_TSR9.
* To use register names with standard convension, please use DMA_TSR9.
*/
#define	DMA_TSR009	(DMA_TSR9)

/** \\brief  1F68, DMA Transaction State Register */
#define DMA_TSR90 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F68u)

/** Alias (User Manual Name) for DMA_TSR90.
* To use register names with standard convension, please use DMA_TSR90.
*/
#define	DMA_TSR090	(DMA_TSR90)

/** \\brief  1F6C, DMA Transaction State Register */
#define DMA_TSR91 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F6Cu)

/** Alias (User Manual Name) for DMA_TSR91.
* To use register names with standard convension, please use DMA_TSR91.
*/
#define	DMA_TSR091	(DMA_TSR91)

/** \\brief  1F70, DMA Transaction State Register */
#define DMA_TSR92 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F70u)

/** Alias (User Manual Name) for DMA_TSR92.
* To use register names with standard convension, please use DMA_TSR92.
*/
#define	DMA_TSR092	(DMA_TSR92)

/** \\brief  1F74, DMA Transaction State Register */
#define DMA_TSR93 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F74u)

/** Alias (User Manual Name) for DMA_TSR93.
* To use register names with standard convension, please use DMA_TSR93.
*/
#define	DMA_TSR093	(DMA_TSR93)

/** \\brief  1F78, DMA Transaction State Register */
#define DMA_TSR94 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F78u)

/** Alias (User Manual Name) for DMA_TSR94.
* To use register names with standard convension, please use DMA_TSR94.
*/
#define	DMA_TSR094	(DMA_TSR94)

/** \\brief  1F7C, DMA Transaction State Register */
#define DMA_TSR95 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F7Cu)

/** Alias (User Manual Name) for DMA_TSR95.
* To use register names with standard convension, please use DMA_TSR95.
*/
#define	DMA_TSR095	(DMA_TSR95)

/** \\brief  1F80, DMA Transaction State Register */
#define DMA_TSR96 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F80u)

/** Alias (User Manual Name) for DMA_TSR96.
* To use register names with standard convension, please use DMA_TSR96.
*/
#define	DMA_TSR096	(DMA_TSR96)

/** \\brief  1F84, DMA Transaction State Register */
#define DMA_TSR97 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F84u)

/** Alias (User Manual Name) for DMA_TSR97.
* To use register names with standard convension, please use DMA_TSR97.
*/
#define	DMA_TSR097	(DMA_TSR97)

/** \\brief  1F88, DMA Transaction State Register */
#define DMA_TSR98 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F88u)

/** Alias (User Manual Name) for DMA_TSR98.
* To use register names with standard convension, please use DMA_TSR98.
*/
#define	DMA_TSR098	(DMA_TSR98)

/** \\brief  1F8C, DMA Transaction State Register */
#define DMA_TSR99 /*lint --e(923)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F8Cu)

/** Alias (User Manual Name) for DMA_TSR99.
* To use register names with standard convension, please use DMA_TSR99.
*/
#define	DMA_TSR099	(DMA_TSR99)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDMA_REG_H */
